require './lib/system_game.cgi';
 #=================================================
 # 基本設定(ｹﾞｰﾑ用) Created by Merino
 #=================================================
 
 # 自然治癒時間(秒)。この時間ごとにHPとMPが1回復(MPは+20%秒)
 $heal_time = 10;
 
 # 国ﾃﾞｰﾀのﾊﾞｯｸｱｯﾌﾟ(0:しない,1:する)
 # ※しない場合は、ﾌﾟﾚｲﾔｰ一覧が更新されないので、ﾌﾟﾚｲﾔｰ一覧をリンクから外してください。
 $is_backup_countries = 1;
 
 # 待ち伏せの有効時間(時)
 $max_ambush_hour = 8;
 
 # ------------------
 # 性別
 @sexes = ('--', '男','女');
 
 # 国の状態
 @country_states = ('なし','豊作','景気','暴風','不況','飢饉',);
 #                   0      1      2      3      4      5
 
 # 世界情勢
 @world_states = ('平和',  '繁栄','革命','略奪','暴君','混沌','結束','鉄壁','不仲','絶望','深淵','監禁','厄年','終焉','大殺界','迷走','匿名','白兵','殺伐','謎','花火','拙速','英雄','三国志','不倶戴天','混乱',   '暗黒');
 #                 0        1      2      3      4      5      6      7      8      9      10     11     12     13     14       15     16     17     18     19    20     21     22      23        24       25        26
 
 # 階級名と兵士数 ◎追加/変更/削除/並び替え自由
 @ranks     = (qw/傭兵 見習い兵 一般兵 上級兵 隊長 准尉 少尉 中尉 大尉 少佐 中佐  大佐  少将  中将  大将  皇帝/);
 @rank_sols = (qw/0    1000     2000   3000   4000 5000 6000 7000 8000 9000 10000 12000 14000 16000 18000 20000/);
 #                0    1        2      3      4    5    6    7    8    9    10    11    12    13    14    15
 
 # イベント期間
 $event_start = '2014-07-26';
 $event_end = '2014-08-31';
 
 #=================================================
 # 値の日本語読み ◎追加/変更/削除/並び替え自由
 #=================================================
 %e2j = ( # English to Japanese
 	# %cs
 	name	=> '国名',
 	strong	=> '国力',
 	food	=> '総兵糧',
 	money	=> '国家予\算',
 	soldier	=> '総兵士数',
 	tax		=> '税率',
 	state	=> '状態',
 	ceo		=> '君主',
 	war		=> '参謀',
 	dom		=> '内政官',
 	pro		=> '外交官',
 	mil		=> '策士',
 	
 	# %m
 	max_hp	=> 'ＨＰ',
 	max_mp	=> 'ＭＰ',
 	hp		=> 'HP',
 	mp		=> 'MP',
 	at		=> '力',
 	df		=> '守り',
 	mat		=> '魔力',
 	mdf		=> '魔防',
 	ag		=> '素早',
 	lea		=> '統率',
 	cha		=> '魅力',
 	exp		=> '経験値',
 	rank_exp=> '貢献値',
 );
 
 
 #=================================================
 # 部隊。◎追加/変更/削除/並び替え自由
 #=================================================
 # 攻撃・被ﾀﾞﾒｰｼﾞは数字が大きい方がﾀﾞﾒｰｼﾞｱｯﾌﾟ、少ない方がﾀﾞﾒｰｼﾞﾀﾞｳﾝ
 # 天馬,重兵,飛竜は./lib/war.cgiで進軍時間増減
 @units = (
 	#0No,1名前,2下位ｸﾗｽ,3必要勲章,4攻撃,5被ﾀﾞﾒｰｼﾞ,6有利な部隊No
 	[0,		'歩兵部隊',		0,	0,	1.0, 1.0, [9,17,				], [1, 2, 3]],
             
 	[1,		'重兵部隊',		0,	5,	0.8, 0.75, [2, 9, 10,17,18		], [1, 2, 3]],
 	[2,		'斧騎兵部隊',	1,	5,	1.1, 0.9, [5, 7, 10,16,17		], [1, 2, 3]],
 	[3,		'黒騎士部隊',	2,	30,	1.0, 0.8, [2, 6, 7, 10,16,17,18		], [1, 2, 3]],
             
 	[4,		'騎兵部隊',		0,	10,	1.1, 1.0, [0,16,17				], [1, 2, 3]],
 	[5,		'槍騎兵部隊',	4,	10,	1.1, 1.0, [3, 4, 6,			], [1, 2, 3]],
 	[6,		'聖騎士部隊',	5,	30,	1.2, 1.0, [2, 3, 8, 11,17		], [1, 2, 3]],
             
 	[7,		'天馬部隊',		4,	20,	1.0, 1.0, [12, 13,16,17			], [1, 2, 3]],
 	[8,		'飛竜部隊',		7,	30,	1.1, 1.0, [0, 1,16,17			], [1, 2, 3]],
             
 	[9,		'弓兵部隊',		0,	5,	1.1, 1.0, [4, 7, 8, 12, 15,	], [1, 2, 3]],
 	[10,	'弓騎兵部隊',	9,	10,	1.1, 1.0, [4, 7, 8, 13, 15,	], [1, 2, 3]],
 	[11,	'暗殺部隊',		10,	30,	1.2, 1.2, [14,				], [1, 2, 3]],
             
 	[12,	'魔導部隊',		0,	5,	1.1, 1.1, [1, 8, 15,16,17,18		], [1, 2, 3]],
 	[13,	'魔騎兵部隊',	12,	10,	1.2, 1.1, [1, 3, 8, 15		], [1, 2, 3]],
 	[14,	'幻影部隊',		13,	30,	1.2, 1.2, [7, 8,			], [1, 2, 3]],
 	
 	[15,	'魔物部隊',		13,	30,	1.1, 1.1, [0, 11, 14,16,17,18		], [1, 2, 3]],
 	
 	[16,	'軽装部隊',		0,	10,	1.0, 1.1, [0,5,14,18		], [1, 2, 3]],
 	[17,	'隠密部隊',		0,	30,	0.5, 1.0, [17		], [1, 2, 3]],
 	[18,	'狡知部隊',		0,	100,	1.0, 1.0, [17		], [1, 2, 3]],
 );
 
 
 #=================================================
 # 職業。◎追加/変更/削除/並び替え自由
 #=================================================
 # 「商人、卵士、遊び人、忍者、魔物使い」は名前で判別処理をしているので、
 #  名前を変更するときは判別処理している方も変えること
 
 # ※成長率。例> 3 の時: ﾚﾍﾞﾙｱｯﾌﾟ時に 0～3 上がる。ただし、HPは必ず 1 以上あがる仕様
 @jobs = (
 	#0No,1名前, ※2HP,3MP,4AT,5DF,6MAT,7MDF,8AG,9LEA,10CHA,11転職条件
 	[0, '無職',		3,	2,	2,	2,	2,	2,	2,	1,	1,		sub{ 1 }],
 	[1, '戦士',		5,	1,	4,	3,	1,	1,	1,	1,	1,		sub{ $m{shu_c} >= 100 }],
 	[2, '魔道士',	1,	4,	1,	1,	5,	3,	3,	1,	1,		sub{ $m{gik_c} >= 20 }],
 	[3, '商人',		2,	2,	2,	2,	2,	2,	2,	1,	2,		sub{ $m{sho_c} >= 20 }], # main.cgi,myself_shop.cgi,_myself_goods.cgiで「商人」で判別処理
 	[4, '卵士',		2,	2,	1,	2,	1,	3,	2,	1,	4,		sub{ $m{nou_c} >= 20 }], # main.cgiで「卵士」で判別処理
 	[5, '踊り子',	2,	3,	1,	2,	1,	4,	4,	1,	5,		sub{ $m{hei_c} >= 20 }],
 	[6, '遊び人',	1,	2,	1,	1,	2,	3,	3,	1,	5,		sub{ $m{cas_c} >= 100 }], # hunting.cgi「遊び人」で判別処理
 	[7, '騎士',		4,	2,	3,	5,	1,	2,	1,	1,	1,		sub{ $m{mat_c} >= 15 }],
 	[8, '剣士',		3,	1,	5,	2,	1,	1,	3,	1,	2,		sub{ $m{col_c} >= 15 }],
 	[9, '忍者',		2,	4,	2,	1,	2,	1,	5,	1,	2,		sub{ $m{tei_c} >= 20 }], # shopping_unit_exchange.cgi「忍者」で判別処理
 	[10,'勇者',		3,	2,	3,	4,	1,	1,	2,	2,	3,		sub{ $m{tou_c} >= 300 }],
 	[11,'秘書',		3,	3,	1,	1,	3,	3,	2,	3,	2,		sub{ $m{gai_c} >= 20 }],
 	[12,'司祭',		1,	5,	1,	1,	5,	2,	2,	2,	3,		sub{ $m{gou_c} + $m{cho_c} + $m{sen_c} >= 50 }],
 	[13,'軍師',		2,	2,	1,	2,	3,	2,	3,	4,	2,		sub{ $m{win_c} >= 10 }],
 	[14,'闘神',		3,	1,	4,	3,	1,	1,	1,	4,	2,		sub{ $m{win_c} >= 50 }],
 	[15,'賢者',		1,	5,	2,	2,	4,	3,	2,	3,	3,		sub{ 0 }],
 	[16,'天使',		3,	3,	2,	2,	3,	4,	3,	1,	3,		sub{ 0 }],
 	[17,'悪魔',		1,	3,	4,	2,	3,	5,	3,	3,	2,		sub{ 0 }],
 	[18,'死神',		1,	4,	4,	1,	4,	1,	4,	1,	4,		sub{ 0 }],
 	[19,'魔物使い',	2,	2,	1,	3,	3,	1,	2,	2,	4,		sub{ $m{mon_c} >= 5 }], # shopping_unit_exchange.cgi「魔物使い」で判別処理
 	[20,'魔法戦士',	4,	3,	3,	1,	4,	1,	1,	1,	1,		sub{ $m{shu_c} >= 100 && $m{gik_c} >= 10 }],
 	[21,'王族',		1,	2,	1,	3,	1,	2,	1,	5,	4,		sub{ $m{pet} == 58}], # shopping_job_change.cgiで生贄処理
 	[22,'童貞',		1,	4,	1,	4,	1,	4,	1,	1,	1,		sub{ $m{boch_c} >= 20 && $m{sex} eq '1' && $m{marriage} eq '' }], # shopping_marriage.cgiで結婚時無職処理
 	[23,'童帝',		2,	5,	2,	5,	2,	5,	2,	4,	2,		sub{ $m{boch_c} >= 100 && $m{sex} eq '1' && $m{marriage} eq '' }], # shopping_marriage.cgiで結婚時無職処理
 	[24,'魔法少女',	2,	4,	1,	1,	3,	3,	1,	3,	5,		sub{ $m{boch_c} >= 20 && $m{sex} eq '2' && $m{marriage} eq '' && $m{lv} <= 15 }], # shopping_marriage.cgiで結婚時無職処理
 	[25,'大賢者',		2,	6,	3,	3,	5,	4,	3,	4,	4,		sub{ 0 }],
 	[26,'天使長',		4,	4,	4,	4,	4,	5,	4,	2,	4,		sub{ 0 }],
 	[27,'悪魔侯爵',		2,	4,	5,	3,	4,	6,	4,	4,	3,		sub{ 0 }],
 	[28,'死神大王',		2,	5,	5,	2,	5,	2,	5,	2,	5,		sub{ 0 }],
 );
 
 
 
 #=================================================
 # 称号 上３つ以外の称号は ◎追加/変更/削除/並び替え自由
 #=================================================
 # お尋ね者,★永遠の証は称号名の変更は可能
 # ★付のものは自由称号でなることができない
 @shogos = (
 	['',			{ dummy => 0 },		0,	], # 称号なし
 	['ゴミクズ',	{ dummy => 1 },		0,	], # 条件により一時的になるもの(闇金融,寝返り)
 	['★永遠の証',	{ dummy => 1 },		0,	], # 称号ｺﾝﾌﾟしたらなれる
 
 	#[0]称号名,[1]取得条件{ 熟練度名 => 回数 },[2]報奨金
 	['覇者',		{ hero_c => 1 },	100000,	],
 	['★覇王',		{ hero_c => 2 },	300000,	],
 	['破壊者',		{ met_c => 1  },	50000,	],
 	['★罪と罰',	{ met_c => 3  },	100000,	],
 	['救世主',		{ huk_c => 1  },	50000,	],
 	['★ミラクル',	{ huk_c => 3  },	100000,	],
 
 	['貴族',		{ sedai => 3   },	10000,	],
 	['★名門',		{ sedai => 10  },	50000,	],
 	['★暇人',		{ sedai => 20  },	100000,	],
 	['★廃神',		{ sedai => 100  },	200000,	],
 	['特攻隊長',	{ win_c => 20  },	50000,	],
 	['百戦錬磨',	{ win_c => 100 },	100000,	],
 	['★国士無双',	{ win_c => 300 },	250000,	],
 	['★一騎当千',	{ win_c => 1000 },	1000,	],
 	['剣豪',		{ col_c => 50  },	100000,	],
 	['★王者',		{ col_c => 150 },	250000,	],
 	['★拳王',		{ col_c => 500 },	300000,	],
 	['★範馬の血',		{ col_c => 1000 },	10,	],
 
 	['修行僧',		{ shu_c => 200  },	20000,	],
 	['★唯我独尊',	{ shu_c => 1000 },	100000,	],
 	['★東方不敗',	{ shu_c => 5000 },	200000,	],
 	['★百式観音',	{ shu_c => 10000 },	23,	],
 	['ハンター',	{ tou_c => 200  },	20000,	],
 	['★英雄',		{ tou_c => 1000 },	100000,	],
 	['★もょもと',		{ tou_c => 5000 },	200000,	],
 	['★ああああ',		{ tou_c => 10000 },	2,	],
 	['ニート',		{ cas_c => 200  },	20000,	],
 	['★勝負師',	{ cas_c => 1000 },	100000,	],
 	['★倍プッシュ',	{ cas_c => 5000 },	200000,	],
 	['★ざわ…ざわ…',	{ cas_c => 10000 },	200,	],
 
 	['大地の恵',	{ nou_c => 50  },	50000,	],
 	['★太陽の恵',	{ nou_c => 200 },	200000,	],
 	['★大地主',	{ nou_c => 500 },	250000,	],
 	['★百万石',	{ nou_c => 1000 },	686,	],
 	['繁栄の糧',	{ sho_c => 50  },	50000,	],
 	['★大富豪',	{ sho_c => 200 },	200000,	],
 	['★ゲイツ',	{ sho_c => 500 },	250000,	],
 	['★石油王',	{ sho_c => 1000 },	42,	],
 	['徴集の柱',	{ hei_c => 50  },	50000,	],
 	['★カリスマ',	{ hei_c => 200 },	200000,	],
 	['★赤紙',	{ hei_c => 500 },	250000,	],
 	['★学徒動員',	{ hei_c => 1000 },	75,	],
 	['交渉人'	,	{ gai_c => 50  },	50000,	],
 	['★国務秘書',	{ gai_c => 200 },	200000,	],
 	['★友愛',	{ gai_c => 500 },	250000,	],
 	['★ぽっぽ',	{ gai_c => 1000 },	78,	],
 
 	['強奪王',		{ gou_c => 50  },	50000,	],
 	['★王泥棒',	{ gou_c => 200 },	200000,	],
 	['★ルパン',	{ gou_c => 500 },	250000,	],
 	['★ぶんどる',	{ gou_c => 1000 },	666,	],
 	['諜報委員',	{ cho_c => 50  },	50000,	],
 	['★闇組織',	{ cho_c => 200 },	200000,	],
 	['★ハッカー',	{ cho_c => 500 },	250000,	],
 	['★カツアゲ',	{ cho_c => 1000 },	76,	],
 	['催眠術師',	{ sen_c => 50  },	50000,	],
 	['★教祖様',	{ sen_c => 200 },	200000,	],
 	['★人さらい',	{ sen_c => 500 },	250000,	],
 	['★工作員',	{ sen_c => 1000 },	123,	],
 	['情報屋',		{ tei_c => 50  },	50000,	],
 	['★裏スパイ',	{ tei_c => 200 },	200000,	],
 	['★光学迷彩',	{ tei_c => 500 },	250000,	],
 	['★スネーク',	{ tei_c => 1000 },	30,	],
 	['門番',		{ mat_c => 30  },	50000,	],
 	['★守護神',	{ mat_c => 150 },	200000,	],
 	['★メイン盾',	{ mat_c => 500 },	250000,	],
 	['★ガイル',	{ mat_c => 1000 },	1000,	],
 	['ペテン師',	{ gik_c => 50  },	50000,	],
 	['★ペルソナ',	{ gik_c => 200 },	200000,	],
 	['★どえむ',	{ gik_c => 500 },	250000,	],
 	['★茨の君',	{ gik_c => 1000 },	50,	],
 	['★人力ﾒﾃｵ',	{ gik_c => 2080 },	2080,	],
 
 	['支配者',		{ mon_c => 10  },	50000,	],
 	['★魔王',		{ mon_c => 50  },	200000,	],
 	['★だいまおー',		{ mon_c => 100  },	250000,	],
 	['逃亡者',		{ esc_c => 10  },	50000,	],
 	['★脱獄王',		{ esc_c => 50  },	200000,	],
 	['★ぬらりひょん',		{ esc_c => 100  },	250000,	],
 	['レスキュー隊',		{ res_c => 50  },	50000,	],
 	['★解放軍',		{ res_c => 200  },	200000,	],
 	['お祭り野郎',		{ fes_c => 5  },	200000,	],
 	['★クラスの人気者',		{ fes_c => 10  },	500000,	],
 	['★古参',		{ fes_c => 20  },	99999,	],
 	['ﾊﾞﾘﾊﾞﾘ最強',		{ no1_c => 10  },	1,	],
 	['★世界で一番の花',		{ no1_c => 20  },	1,	],
 	['★唯一者',		{ no1_c => 50  },	1,	],
 	['★ﾗﾝｷﾝｸﾞの頂点',		{ no1_c => 100  },	1,	],
 
 );
 
 require './secret_shogos.cgi';
 
 #=================================================
 # 武器。◎追加/変更/削除/並び替え自由
 #=================================================
 @weas = (
 	#[0]No,	[1]名前,		[2]属性,[3]強さ,		[4]耐性,[5]重さ
 	[0,		'----',			'無',	0,				0,		0,],
 	
 	[1,		'ﾌﾞﾛﾝｽﾞｿｰﾄﾞ',	'剣',	6,				250,	5,],
 	[2,		'ﾑﾗﾏｻ',			'剣',	17,				300,	12,],
 	[3,		'ｸﾘｽﾀﾙｿｰﾄﾞ',	'剣',	32,				350,	23,],
 	[4,		'ﾃｨﾙﾌｨﾝｸﾞ',		'剣',	48,				400,	37,],
 	[5,		'ｴｸｽｶﾘﾊﾞｰ',		'剣',	60,				500,	int(rand(70)),],
                                                       
 	[6,		'ﾛﾝｸﾞｽﾋﾟｱ',		'槍',	10,				250,	8,],
 	[7,		'ｼｬﾍﾞﾘﾝ',		'槍',	22,				300,	20,],
 	[8,		'ｸﾞﾝｸﾞﾆﾙ',		'槍',	49,				450,	45,],
 	[9,		'ｹﾞｲﾎﾞﾙｸ',		'槍',	67,				500,	int(rand(100)),],
 	[10,	'ﾛﾝｷﾞﾇｽ',		'槍',	80,				450,	75,],
                                         		              
 	[11,	'ﾊﾞﾄﾙｱｸｽ',		'斧',	20,				250,	30,],
 	[12,	'ﾄﾏﾎｰｸ',		'斧',	45,				350,	66,],
 	[13,	'ｽﾜﾝﾁｶ',		'斧',	74,				450,	110,],
 	[14,	'ﾃﾞﾋﾞﾙｱｸｽ',		'斧',	200*int(rand(2)),200,	999,],
 	[15,	'ﾊﾙﾊﾞｰﾄﾞ',		'斧',	100,			500,	150,],
                                                       
 	[16,	'ﾌｧｲｱｰ',		'炎',	15,				250,	10,],
 	[17,	'ｴﾙﾌｧｲｱｰ',		'炎',	35,				300,	18,],
 	[18,	'ﾌﾚｲﾑ',			'炎',	55,				400,	30,],
 	[19,	'ﾎﾞﾙｶﾞﾉﾝ',		'炎',	72,				450,	54,],
 	[20,	'ﾌｧﾗﾌﾚｲﾑ',		'炎',	100,			500,	80,],
                                                       
 	[21,	'ｳｨﾝﾄﾞ',		'風',	6,				250,	1,],
 	[22,	'ｴﾙｳｨﾝﾄﾞ',		'風',	20,				300,	4,],
 	[23,	'ﾄﾙﾈｰﾄﾞ',		'風',	40,				350,	10,],
 	[24,	'ﾄﾞﾙﾄﾞｰﾗ',		'風',	int(rand(120)),	250,	30,],
 	[25,	'ﾌｫﾙｾﾃｨ',		'風',	50*int(rand(3)+1),500,	50,],
 
 	[26,	'ｻﾝﾀﾞｰ',		'雷',	8,				250,	4,],
 	[27,	'ｴﾙｻﾝﾀﾞｰ',		'雷',	18,				300,	10,],
 	[28,	'ﾄﾛｰﾝ',			'雷',	40*int(rand(3)),200,	33,],
 	[29,	'ｴｸｽﾄﾘｰﾑ',		'雷',	60,				400,	35,],
 	[30,	'ｽﾀｰﾀﾞｽﾄ',		'雷',	100*int(rand(3)),300,	70,],
 
 	[31,	'ﾄﾞﾚｲﾉｸｻﾘ',		'無',	0,				500,	400,],
 	[32,	'ｸﾛﾑﾊｰﾂ',		'無',	10,				500,	30,],
 	[33,	'ﾐｻｲﾙ',			'無',	300,			500,	100,],
 );
 
  #=================================================
 # 防具。◎追加/変更/削除/並び替え自由
 #=================================================
 @guas = (
 	#[0]No,	[1]名前,		[2]有利属性,[3]強さ,[4]耐性,[5]重さ,	[6]特殊効果
 	[0,		'----',			'----',	0,				0,		0,		sub{},],
 	[1,		'ｽｸﾄｩﾑ',		'剣',	0,				250,	15,		sub{ $gua_relief = 1; },],
 	[2,		'ﾁｪｰﾝﾒｲﾙ',		'槍',	0,				250,	30,		sub{},],
 	[3,		'ｸﾞﾚｰﾄﾍﾙﾑ',		'斧',	100,			250,	10,		sub{},],
 	[4,		'耐火服',		'炎',	100,			250,	10,		sub{},],
 	[5,		'ﾏﾝﾄ',			'風',	100,			250,	5,		sub{},],
 	[6,		'ｸﾜﾊﾞﾗのお守り','雷',	0,				250,	2,		sub{},],
 	[7,		'ｾﾞﾛｸﾞﾗﾋﾞﾃｨ',	'無',	0,				250,	0,		sub{},],
 	[8,		'ｼﾝｶﾞﾝ',		'剣',	0,				250,	50,		sub{},],
 	[9,		'ﾛｹｯﾄﾍﾟﾝﾀﾞﾝﾄ',	'槍',	0,				250,	1,		sub{ if (rand(10) < 3) { $gua_remain = 1; } },],
 	[10,	'ﾊﾟﾜｰﾄﾞｽｰﾂ',	'斧',	100,			250,	400,	sub{},],
 	[11,	'ﾔｻｶﾆﾉﾏｶﾞﾀﾏ',	'炎',	0,				250,	10,		sub{ if (rand(10) < 5) { $gua_half_damage = 1; } },],
 	[12,	'ﾔﾀﾉｶｶﾞﾐ',		'風',	0,				250,	200,	sub{ if (rand(10) < 1) { $gua_skill_mirror = 1; } },],
 	[13,	'送電服',		'雷',	0,				250,	25,		sub{},],
 	[14,	'ﾈｺﾐﾐ',			'無',	0,				250,	3,		sub{ if (rand(10) < 3) { $gua_avoid = 1; } },],
 	[15,	'ｹﾞﾝｼﾞﾉｺﾃ',		'剣',	50,				250,	500,	sub{},],
 	[16,	'未実装',		'槍',	0,				250,	999,	sub{},],
 	[17,	'未実装',		'斧',	0,				250,	999,	sub{},],
 	[18,	'炎の鎧',		'炎',	50,				250,	300,	sub{},],
 	[19,	'未実装',		'風',	0,				250,	999,	sub{},],
 	[20,	'未実装',		'雷',	0,				250,	999,	sub{},],
 	[21,	'狂戦士の魂',	'無',	0,				250,	21,		sub{},],
 );
 
 
 #=================================================
 # ﾀﾏｺﾞ。◎追加/変更/削除/並び替え自由
 #=================================================
 # ※ xxxxxx.cgiに埋め込み処理というのは、そのﾌｧｲﾙの中で何か処理を加えている
 # 「..」は「～」の意味　例> 1..6 = 1,2,3,4,5,6
 @eggs = (
 	#[0]No,	[1]名前,[2]必要な成長値,[3]産まれるﾍﾟｯﾄNo
 	[0,		'----',			0,		[				]],
 	[1,		'ﾗﾝﾀﾞﾑｴｯｸﾞ',	999,	[1..6,14..16,22..41,72,73,76..124,128..134,164..167, 196]],
 	[2,		'ﾊﾃﾅｴｯｸﾞ',		999,	[1..77,135,136,137,139..153,164,178,179,184,187..190,192,199	]],
 	[3,		'ﾄﾞﾘｰﾑｴｯｸﾞ',	999,	[1..153,164..190	,192..196, 198..201		]],
 	
 	[4,		'ｱﾋﾞﾘﾃｨｴｯｸﾞ',	800,	[78..110		]], # main.cgiに埋め込み処理
 	[5,		'ｳｨﾝﾄﾞｴｯｸﾞ',	500,	[102..104		]],
 	[6,		'ﾑｰﾝｴｯｸﾞ',		500,	[108..110		]],
 	[7,		'ﾌｧｲｱｰｴｯｸﾞ',	500,	[90..92			]],
 	[8,		'ｳｫｰﾀｰｴｯｸﾞ',	500,	[99..101		]],
 	[9,		'ﾂﾘｰｴｯｸﾞ',		500,	[87..89			]],
 	[10,	'ｻﾝﾀﾞｰｴｯｸﾞ',	500,	[96..98			]],
 	[11,	'ｱｰｽｴｯｸﾞ',		500,	[93..95			]],
 	[12,	'ﾀﾞｰｸｴｯｸﾞ',		500,	[105..107		]],
 	[13,	'ﾗｲﾄｴｯｸﾞ',		500,	[84..86			]],
 	[14,	'ﾌﾟﾗﾁﾅｴｯｸﾞ',	500,	[78..80			]],
 	[15,	'ｼﾙﾊﾞｰｴｯｸﾞ',	500,	[81..83			]],
 
 	[16,	'ｽｷﾙｴｯｸﾞ',		400,	[28..41,178,179		]],
 	[17,	'ﾌﾟﾘﾃｨｴｯｸﾞ',	400,	[22,23,24,31,164,172	]],
 	[18,	'ｸｰﾙｴｯｸﾞ',		500,	[34,36,37,40,172	]],
 	[19,	'ｽｰﾊﾟｰｴｯｸﾞ',	600,	[4,25,29,30,32,33,196]],
 	[20,	'ﾚｲﾝﾎﾞｰｴｯｸﾞ',	600,	[35,39,42,112	]],
 	[21,	'ﾚｼﾞｪﾝﾄﾞｴｯｸﾞ',	600,	[65..67,65..67,69,70]],
 
 	[22,	'ｱﾝﾃﾞｯﾄｴｯｸﾞ',	400,	[120,121,124,149,174,195]],
 	[23,	'ﾏｼﾞｯｸｴｯｸﾞ',	400,	[111,112,113,122]], # shopping_unit_exchange.cgi Noで判定処理
 	[24,	'ﾌﾞﾗｯﾄﾞｴｯｸﾞ',	400,	[115..117,148,200]],
 	
 	[25,	'ｸﾘｽﾀﾙｴｯｸﾞ',	600,	[1,2,112,133	]],
 	[26,	'ﾃﾞﾋﾞﾙｴｯｸﾞ',	666,	[27,44,47,149,173	]],
 	[27,	'ﾊﾟﾝﾄﾞﾗｴｯｸﾞ',	666,	[11,131,134,136	]],
 	[28,	'ﾎｯﾄｴｯｸﾞ',		700,	[41,48,114,170		]],
 	[29,	'ｺﾞｰﾙﾄﾞｴｯｸﾞ',	777,	[14,15,38,67	]],
 	[30,	'ﾊﾟﾜｰｴｯｸﾞ',		700,	[10,123,132,132,165	]],
 	[31,	'ﾌﾟﾁｴｯｸﾞ',		700,	[43,45,46		]],
 	[32,	'ﾗﾌﾞﾘｰｴｯｸﾞ',	700,	[48,57,57,62,62,63,166,167]],
 	[33,	'ｳｪﾎﾟﾝｴｯｸﾞ',	800,	[72,73,72..75	]],
 	[34,	'ｷｰｴｯｸﾞ',		800,	[3,16,65		]],
 	[35,	'ﾅｲﾄｴｯｸﾞ',		800,	[49,52,55,118,192	]],
 	[36,	'ﾄﾞﾗｺﾞﾝｴｯｸﾞ',	900,	[50,51,53,54,56,80]],
 	[37,	'ｺﾞｯﾄﾞｴｯｸﾞ',	999,	[64,64,68,71,71,135]],
 	[38,	'ｴﾘｰﾄｴｯｸﾞ',		999,	[9,13,58,59		]],
 	[39,	'ﾃﾞｽｴｯｸﾞ',		999,	[8,19,20,124	]],
 	[40,	'ｴﾝｼﾞｪﾙｴｯｸﾞ',	999,	[17,18,21,199	]],
 	[41,	'ﾏｽﾀｰｴｯｸﾞ',		999,	[7,12,12,60,150,150,193	]],
 
 	[42,	'ﾊｽﾞﾚｴｯｸﾞ',		400,	[76,76,77		]], # main.cgiに埋め込み処理
 	[43,	'ﾓﾝｽﾀｰｴｯｸﾞ',	500,	[128..130		]],
 
 # Ver1.58,Ver2.38以降追加
 	[44,	'ﾄﾘｯｷｰｴｯｸﾞ',	700,	[5,145..147,187		]],
 	[45,	'ｴﾝﾄﾞｴｯｸﾞ',		999,	[61,137,143,144,144,152,152]],
 	[46,	'ﾊﾞﾂｴｯｸﾞ',		999,	[134,139..142	]],
 	[47,	'ｸﾗｲﾑｴｯｸﾞ',		999,	[19,60,139..142	]],
 
 # Ver1.66,Ver2.46以降追加
 	[48,	'ﾌﾞﾚｲｸｴｯｸﾞ',	666,	[6,119,131,131	]],
 	[49,	'ｴﾚﾒﾝﾄｴｯｸﾞ',	900,	[80,83,86,89,92,95,98,101,104,107,110]],
 	[50,	'ﾁｮｺｴｯｸﾞ',		500,	[14,26,28,65,171	]],
 
 # Ver1.80,Ver2.60以降追加
 	[51,	'ﾋﾞｷﾞﾅｰｴｯｸﾞ',	100,	[81,82,132,153..163,153..163,154..163,]],
 
 	[52,	'ﾈﾀｴｯｸﾞ',	400,	[165,166,167,169,171,177,184,187]],
 	[53,	'ﾊｽﾞﾚｴｯｸﾞ',	400,	[180,180,181]],
 	[54,	'ﾀｷｵﾝｴｯｸﾞ',	9999,	[7,8,17,21,127,168,183,188,199]], # main.cgiに追加処理あり
 	[55,	'ｲﾀｽﾞﾗｴｯｸﾞ',	400,	[164,175,176,185,186,189,190,198,201]],
 );
 
 
 #=================================================
 # ﾍﾟｯﾄ。◎追加/変更自由。△削除/並び替えはﾀﾏｺﾞの[3]産まれるﾍﾟｯﾄNoと合わせてね
 #=================================================
 # ｻﾌﾞﾙｰﾁﾝで値を受け渡す場合($_[0]を使用する場合)は 戻り値 ２つ(return $v, 1)
 @pets = (
 	#[0]No,	[1]名前,	[2]発動,		[3]処理,	[4]誕生セリフ	[5]合成可能フラグ
 	[0,		'----',		'',				sub{} ,],
 	
 # その他
 	[1,		'ｺﾃﾂ',		'smith',		sub{ ++$m{wea_lv} if $m{wea_lv} < 30 },'虎徹を見たら偽物と思え'],
 	[2,		'ｵｾｼﾞﾝ',	'smith',		sub{ $mes.="$pets[$m{pet}][1]★$m{pet_c}の効果で修理金が半額になりました<br>"; return $_[0] * (0.5 - $m{pet_c} * 0.025), 1;}, '', 1],
 	[3,		'ﾗｯｷｰ',		'get_item',		sub{},'クッキー・八代亜紀'], # hunting.cgiに埋め込み処理
 	[4,		'ﾊﾝﾄ',		'hunt_money',	sub{ return int($_[0] * (1.5 + $m{pet_c} * 0.075)), 1 },'一狩りいこうぜ！', 1],
 
 # 戦争補助
 	[5,		'ﾄｳﾀｸ',		'war_begin',	sub{ my $v=int($m{sol}*(0.1 + $m{pet_c} * 0.005)); $m{sol}+=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}が $v の援軍を率いてきました<br>"; }, '', 1],
 	[6,		'ﾅﾀｸ',		'war_begin',	sub{ my $v=int(rand(3000 * (1 + $m{pet_c} * 0.05)));  $m{sol}+=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}が $v の援軍を率いてきました<br>"; }, '', 1],
 	[7,		'ﾀﾞｰｸﾎｰｽ',	'speed_up',		sub{},'ひひーん'], # war_form.cgiに埋め込み処理
 	[8,		'ｺﾞｰｽﾄ',	'no_ambush',	sub{},'ねないこだれだ'], # war.cgiに埋め込み処理
 	[9,		'ﾌｧﾝﾄﾑ',	'no_shadow',	sub{},'ｷﾝｸﾞと思ったか？俺だよ！', 1], # war.cgiに埋め込み処理
 	[10,	'ｱｷﾚｽ',		'war_single',	sub{}], # war.cgiに埋め込み処理
 	[11,	'ｽﾈｲｸ',		'war_result',	sub{ return $_[0] + 100, 1 },'こちらｽﾈｲｸ、預かり所に潜入した'],
 	[12,	'ﾛｷ',		'war_result',	sub{ return $_[0] * 1.5, 1 }],
 	[13,	'ｽｶｰﾚｯﾄ',	'war_win',		sub{ ++$m{medal}; if (rand(20) < $m{pet_c}) { ++$m{medal}; $mes .= "$pets[$m{pet}][1]★$m{pet_c}の効果でさらに勲章が追加されました。"; } }, '', 1],
 
 # 給与補助
 	[14,	'ﾏﾈｷﾈｺ',	'salary',	sub{ return $_[0] + 15000 + (100 * $m{pet_c} * $m{pet_c}), 1 }, '', 1],
 	[15,	'ﾏﾊﾗｼﾞｬ',	'salary',	sub{ return $_[0] * 1.5, 1 }],
 	[16,	'ﾋﾞｯｷｰ',	'salary',	sub{ $m{egg_c} += int(rand(100)+50) if $m{egg} }],
 
 # 世代交代
 	[17,	'ﾗﾌｧｴﾙ',	'sedai',		sub{ &_pet_sedai_job(15, 25) },'ｶﾞﾌﾞﾘｴﾙだと思った？残念！ﾗﾌｧｴﾙちゃんでした！', 1],
 	[18,	'ﾐｶｴﾙ',		'sedai',		sub{ &_pet_sedai_job(16, 26) }, '', 1],
 	[19,	'ｻﾀﾝ',		'sedai',		sub{ &_pet_sedai_job(17, 27) }, '', 1],
 	[20,	'ﾊﾃﾞｽ',		'sedai',		sub{ &_pet_sedai_job(18, 28) }, '', 1],
 	[21,	'ｶﾞﾌﾞﾘｴﾙ',	'keep_status',	sub{},'またせたなっ！'], # main.cgiのsub lv_upに直接埋め込み処理
 
 # 内政効果up系
 	[22,	'ﾒｹﾒｹ',		'nou',		sub{ return $_[0] * 1.5, 1 }],
 	[23,	'ﾓｺﾓｺ',		'sho',		sub{ return $_[0] * 1.5, 1 }],
 	[24,	'ｼｰｻﾞｰ',	'hei',		sub{ return $_[0] * 1.5, 1 },'「水鉄砲は穴が小さい方がイキオイよく遠くまで飛ぶ！」ということだ！<BR>わかったかスカタン！'],
 	[25,	'ﾋﾞｰｽﾄ',	'gou',		sub{ return $_[0] * 1.3, 1 },'イキスギイクゥ！イクゥイクイクイク…アッ…ンアッー！'],
 	[26,	'ｹｯﾄ･ｼｰ',	'cho',		sub{ return $_[0] * 1.3, 1 },'カツアゲは公立の特権'],
 	[27,	'ﾅｲﾄﾒｱ',	'sen',		sub{ return $_[0] * 1.3, 1 }],
 
 # 熟練度up系
 	[28,	'ﾓｰｸﾞ',		'nou',		sub{ &c_up('nou_c'); &_pet_c_bonus; },'クポッ！', 1],
 	[29,	'ｱｷﾝﾄﾞ',	'sho',		sub{ &c_up('sho_c'); &_pet_c_bonus; }, '', 1],
 	[30,	'ﾜｲﾙﾄﾞ',	'hei',		sub{ &c_up('hei_c'); &_pet_c_bonus; },'生まれたぜぇ～？ワイルドだろ～？', 1],
 	[31,	'ﾎﾟｯﾎﾟ',	'promise',	sub{ &c_up('gai_c'); &_pet_c_bonus; },'国というモノがなんだか良く分らないのです', 1],
 	[32,	'ｶﾝｾﾙ',		'mat',		sub{ &c_up('mat_c'); &_pet_c_bonus; }, '', 1],
 	[33,	'ﾊﾞｯｶｽ',	'gou',		sub{ &c_up('gou_c'); &_pet_c_bonus; }, '', 1],
 	[34,	'ﾃﾞｭｰｸ',	'cho',		sub{ &c_up('cho_c'); &_pet_c_bonus; },'用件を聞こうか･････････', 1],
 	[35,	'ﾊｰﾋﾟｰ',	'sen',		sub{ &c_up('sen_c'); &_pet_c_bonus; }, '', 1],
 	[36,	'ｼﾉﾋﾞｰ',	'tei',		sub{ &c_up('tei_c'); &_pet_c_bonus; },'ドーモ。プレイヤー＝サン。シノビーです', 1],
 	[37,	'ﾍﾟﾃﾝ',		'gik',		sub{ &c_up('gik_c'); &_pet_c_bonus; }, '', 1],
 	[38,	'ｺﾞｰｼﾞｬｽ',	'casino',	sub{ &c_up('cas_c'); }],
 	[39,	'ｱﾙﾃﾐｽ',	'hunting',	sub{ &c_up('tou_c'); }],
 	[40,	'ｿﾙｼﾞｬｰ',	'training',	sub{ &c_up('shu_c'); }],
 	[41,	'ｽﾊﾟﾙﾀ',	'colosseum',sub{ &c_up('col_c'); &_pet_c_bonus; }, '', 1],
 
 # 経験値up系
 	[42,	'ｸﾛﾉｽ',		'domestic',		sub{ return $_[0] + 15, 1 },'ﾅﾉｰﾈ'],
 	[43,	'ﾌﾟﾁｷﾝｸﾞ',	'promise',		sub{ return $_[0] + 20, 1 }],
 	[44,	'ﾘｯﾁｰ',		'military',		sub{ return $_[0] + 20, 1 }],
 	[45,	'ﾌﾟﾁｽﾗｲﾑ',	'training',		sub{ return $_[0] * 1.5, 1 }],
 	[46,	'ﾌﾟﾁﾅｲﾄ',	'hunting',		sub{ return $_[0] * 1.8, 1 }],
 	[47,	'ｽｺｰﾋﾟｵﾝ',	'colosseum',	sub{ $m{egg_c} += int(rand($m{pet_c})) if $m{egg}; return $_[0] * 2.0, 1 }, '', 1],
 	[48,	'ｱﾃﾅ',		'war_win',		sub{ return $_[0] * 3.0, 1 }],
 
 # Lvup+系
 	[49,	'ﾁﾋﾞﾌｧｲﾀｰ',		'lv_up',	sub{ ++$m{max_hp};	$mes .= qq|<br><font color="#CC00FF">$e2j{max_hp}+1</font>|; }],
 	[50,	'ﾎﾜｲﾄﾄﾞﾗｺﾞﾝ',	'lv_up',	sub{ &_pet_lv_up('max_mp'); }, '', 1],
 	[51,	'ﾌﾞﾗｯｸﾄﾞﾗｺﾞﾝ',	'lv_up',	sub{ &_pet_lv_up('at'); }, '', 1],
 	[52,	'ｼｰﾙﾄﾞﾅｲﾄ',		'lv_up',	sub{ ++$m{df};		$mes .= qq|<br><font color="#CC00FF">$e2j{df}+1</font>|; }, '', 1],
 	[53,	'ﾏｼﾞｯｸﾄﾞﾗｺﾞﾝ',	'lv_up',	sub{ &_pet_lv_up('mat'); }, '', 1],
 	[54,	'ﾐｽﾄﾄﾞﾗｺﾞﾝ',	'lv_up',	sub{ &_pet_lv_up('mdf'); }, '', 1],
 	[55,	'ｼｰﾌﾅｲﾄ',		'lv_up',	sub{ ++$m{ag};		$mes .= qq|<br><font color="#CC00FF">$e2j{ag}+1</font>|; }],
 	[56,	'ｷﾝｸﾞﾄﾞﾗｺﾞﾝ',	'lv_up',	sub{ &_pet_lv_up('lea'); }, '', 1],
 	[57,	'ｳﾞｨｰﾅｽ',		'lv_up',	sub{ ++$m{cha}; ++$m{cha_org};		$mes .= qq|<br><font color="#CC00FF">$e2j{cha}+1</font>|; }],
 	[58,	'ｷﾝｸﾞ',			'lv_up',	sub{ ++$m{$_} for (qw/df lea cha cha_org/);		$mes .= qq|<br><font color="#CC00FF">$e2j{df}+1 $e2j{lea}+1 $e2j{cha}+1</font>|; },'荒ぶる…荒ぶるぞ！俺の魂が！！'],
 	[59,	'ﾃﾞｭﾗﾊﾝ',		'lv_up',	sub{ ++$m{$_} for (qw/at df ag/);		$mes .= qq|<br><font color="#CC00FF">$e2j{at}+1 $e2j{df}+1 $e2j{ag}+1</font>|; },'あなたが考えているほど、世界は悪くないから。'],
 	[60,	'ﾙｼﾌｧｰ',		'lv_up',	sub{ ++$m{$_} for (qw/mat mdf lea/);	$mes .= qq|<br><font color="#CC00FF">$e2j{mat}+1 $e2j{mdf}+1 $e2j{lea}+1</font>|; },'話をしよう、あれは今から36万…いや、1万4000年前だったか、 まぁいい、私にとってはつい昨日の出来事だが、君たちにとっては多分明日の出来事だ'],
      
 # 使用したらなくなる
 	# その他
 	[61,	'ｱﾏﾂﾐ',		'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; return if $time + 3600 * 4 * 24 > $w{limit_time}; $w{limit_time} -= 3600 * 24; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い統一期限が少し短くなりました</b>");	}],
 	[62,	'ﾏｰﾒｲﾄﾞ',	'myself',	sub{ return if ($m{sedai} <= 2); $m{lv}-=20; $m{lv}=1 if $m{lv} < 1; $mes.="$pets[$m{pet}][1]★$m{pet_c}の力により$m{name}のLvが下がりました<br>";	}],
 	[63,	'ｲｳﾞ',		'myself',	sub{ $m{rank}=$#ranks; $mes.="$pets[$m{pet}][1]★$m{pet_c}の力により$m{name}は$ranks[$m{rank}]になりました<br>";	},'僕と契約して皇帝になってよ！'],
 
 #	# 国に影響 
 	[64,	'ｾﾞｳｽ',		'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; $cs{strong}[$m{country}] +=1000;  &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い$c_mの$e2j{strong}が1000増加しました</b>");  &_pet_status_up('rank_exp', 50);  	}],
 	[65,	'ｸｯｷｰ',		'myself',	sub{ return unless $m{country}; $cs{food}[$m{country}]   +=50000; &write_cs; &mes_and_world_news("$pets[$m{pet}][1]★$m{pet_c}を使い$c_mの$e2j{food}が50000増加しました");			 &_pet_status_up('rank_exp', 50);	}],
 	[66,	'ﾏﾙｽ',		'myself',	sub{ return unless $m{country}; $cs{soldier}[$m{country}]+=50000; &write_cs; &mes_and_world_news("$pets[$m{pet}][1]★$m{pet_c}を使い$c_mに50000の兵士が集まりました");				 &_pet_status_up('rank_exp', 50);	}],
 	[67,	'ｴﾋﾞｽ',		'myself',	sub{ return unless $m{country}; $cs{money}[$m{country}]  +=50000; &write_cs; &mes_and_world_news("$pets[$m{pet}][1]★$m{pet_c}を使い$c_mの$e2j{money}が50000増加しました");		 &_pet_status_up('rank_exp', 50);	}],
 	[68,	'ﾉｱ',		'myself',	sub{ return if ($w{world} eq $#world_states - 2 || $w{world} eq $#world_states - 3 || $w{world} eq $#world_states - 5); return unless $m{country}; $cs{is_die}[$m{country}] = 1;     &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い$c_mに守りのご加護がつきました</b>");			}],
 	[69,	'ﾒｼｱ',		'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; $cs{state}[$m{country}]  = 1;     &write_cs; &mes_and_world_news("$pets[$m{pet}][1]★$m{pet_c}を使い$c_mが$country_states[1]になりました");			},'我はメシア、明日この世界を粛清する。(54687)'],
 	[70,	'ｼｸﾞﾏ',		'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; $cs{state}[$m{country}]  = 2;     &write_cs; &mes_and_world_news("$pets[$m{pet}][1]★$m{pet_c}を使い$c_mが$country_states[2]になりました");			}],
 	[71,	'ﾛﾌﾟﾄ',		'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使いました</b>"); &disaster; &write_cs;	}],
 
 #	# 武器.ﾀﾏｺﾞに変化(「..」の意味は「～」)
 	[72,	'ｳｪﾎﾟﾝLv1',	'myself',	sub{ &_pet_weapon(2..4, 7..9,  12..14, 17..19, 22..24, 27..29)	}, '', 1], # 武器に変化武器のNo
 	[73,	'ｳｪﾎﾟﾝLv2',	'myself',	sub{ &_pet_weapon(3..5, 8..10, 13..15, 18..20, 23..25, 28..31)	}, '', 1], # 武器に変化武器のNo
 	[74,	'ｳｪﾎﾟﾝLv3',	'myself',	sub{ &_pet_weapon(4..5, 9..10, 14..15, 19..20, 24..25, 29..31)	}, '', 1], # 武器に変化武器のNo
 	[75,	'ｳｪﾎﾟﾝLv4',	'myself',	sub{ &_pet_weapon(   5,    10,     15,     20,     25,     30, 31)	}, '', 1], # 武器に変化武器のNo
 	[76,	'ｴｯｸﾞﾏﾝ',	'myself',	sub{ &_pet_eggman(0,42,42,42,42,42,42,26..36,48..51) }, '', 1], # ﾀﾏｺﾞに変化ﾀﾏｺﾞのNo
 	[77,	'ｴｯｸﾞﾋｰﾛｰ',	'myself',	sub{ &_pet_eggman(0,42,42,42,42,42,42,37..47) }, '', 1], # ﾀﾏｺﾞに変化ﾀﾏｺﾞのNo
 
 #	# ｽﾃｰﾀｽup
 	[78,	'ﾊｰﾐｯﾄ',	'myself',	sub{ &_pet_status_up('exp', 100) }],
 	[79,	'ｸﾞﾘﾌｫﾝ',	'myself',	sub{ &_pet_status_up('exp', 200) }],
 	[80,	'ﾏｽﾀｰﾄﾞﾗｺﾞﾝ','myself',	sub{ &_pet_status_up('exp', 500) }],
 	[81,	'ｲｸﾞﾛｰｸ',	'myself',	sub{ &_pet_status_up('rank_exp', 200) }],
 	[82,	'ｱｯﾗｰ',		'myself',	sub{ &_pet_status_up('rank_exp', 400) }],
 	[83,	'ﾘﾘｽ',		'myself',	sub{ &_pet_status_up('rank_exp', 800) }],
 	[84,	'ｻﾆｰ',		'myself',	sub{ &_pet_status_up('max_hp', 10) }],
 	[85,	'ｱﾚｸｻﾝﾀﾞｰ',	'myself',	sub{ &_pet_status_up('max_hp', 20) }],
 	[86,	'ｳｨｽﾌﾟ',	'myself',	sub{ &_pet_status_up('max_hp', 40) }],
 	[87,	'ﾊﾟﾝﾌﾟｷﾝ',	'myself',	sub{ &_pet_status_up('max_mp', 10) },'──刃が必要だった。'],
 	[88,	'ﾗﾌﾚｼｱ',	'myself',	sub{ &_pet_status_up('max_mp', 20) }],
 	[89,	'ﾄﾞﾘｱｰﾄﾞ',	'myself',	sub{ &_pet_status_up('max_mp', 40) }],
 	[90,	'ﾌｧﾗ',		'myself',	sub{ &_pet_status_up('at',   5) }],
 	[91,	'ｲﾌﾘｰﾄ',	'myself',	sub{ &_pet_status_up('at',  15) }],
 	[92,	'ｻﾗﾏﾝﾀﾞｰ',	'myself',	sub{ &_pet_status_up('at',  30) }],
 	[93,	'ｺﾞｰﾚﾑ',	'myself',	sub{ &_pet_status_up('df',   5) }],
 	[94,	'ﾀｲﾀﾝ',		'myself',	sub{ &_pet_status_up('df',  15) }],
 	[95,	'ﾉｰﾑ',		'myself',	sub{ &_pet_status_up('df',  30) }],
 	[96,	'ﾗｲﾁｮｳ',	'myself',	sub{ &_pet_status_up('mat',  5) },'元始、女性は実に太陽であった'],
 	[97,	'ﾗﾑｳ',		'myself',	sub{ &_pet_status_up('mat', 15) }],
 	[98,	'ﾗｲｼﾞﾝ',	'myself',	sub{ &_pet_status_up('mat', 30) }],
 	[99,	'ｽﾉｳ',		'myself',	sub{ &_pet_status_up('mdf',  5) }],
 	[100,	'ｼｳﾞｧ',		'myself',	sub{ &_pet_status_up('mdf', 15) },'ウー！ハーッ！'],
 	[101,	'ｳﾝﾃﾞｨｰﾈ',	'myself',	sub{ &_pet_status_up('mdf', 30) }],
 	[102,	'ｴｱﾘｱﾙ',	'myself',	sub{ &_pet_status_up('ag',   5) }],
 	[103,	'ｼﾙﾌｨｰﾄﾞ',	'myself',	sub{ &_pet_status_up('ag',  15) }],
 	[104,	'ｼﾞﾝ',		'myself',	sub{ &_pet_status_up('ag',  30) }],
 	[105,	'ｺｱｸﾏ',		'myself',	sub{ &_pet_status_up('lea',  5) }],
 	[106,	'ﾍﾙ',		'myself',	sub{ &_pet_status_up('lea', 15) }],
 	[107,	'ｼｪｲﾄﾞ',	'myself',	sub{ &_pet_status_up('lea', 30) }],
 	[108,	'ｳｻｺ',		'myself',	sub{ &_pet_status_up('cha',  5) }],
 	[109,	'ﾊﾞﾆｰ',		'myself',	sub{ &_pet_status_up('cha', 15) }],
 	[110,	'ﾙﾅ',		'myself',	sub{ &_pet_status_up('cha', 30) }],
      
 # 戦闘系(return if int(rand(X)); ← の数字が発動率[1:毎回|2:多い|3,4:そこそこ|5,6:滅多に]
 	[111,	'ｳｨｯﾁ',		'battle',	sub{ return if rand(2) > 1; my $v=int(rand(30)*(1+$m{pet_c}*0.2)+$m{pet_c}*5);    $m{mp}+=$v;             $mes.="$pets[$m{pet}][1]★$m{pet_c}の補助魔法!$m{name}の$e2j{mp}が$v回復した<br>"; }, '', 1],
 	[112,	'ｶｰﾊﾞﾝｸﾙ',	'battle',	sub{ return if rand(3) > 1; my $v=int((rand(30)*(1+$m{pet_c}*0.2)+30)); $m{mp}+=$v;             $mes.="$pets[$m{pet}][1]★$m{pet_c}の輝く光!$m{name}の$e2j{mp}が$v回復した<br>"; }, '', 1],
 	[113,	'ﾌｪｱﾘｰ',	'battle',	sub{ return if rand(2) > 1; my $v=int(rand(50)*(1+$m{pet_c}*0.05));    $m{hp}+=$v;             $mes.="$pets[$m{pet}][1]★$m{pet_c}の癒しの風!$m{name}の$e2j{hp}が$v回復した<br>"; }, '', 1],
 	[114,	'ﾌｪﾆｯｸｽ',	'battle',	sub{ return if rand(3) > 1; my $v=int((rand(50)*(1+$m{pet_c}*0.05)+50)); $m{hp}+=$v;             $mes.="$pets[$m{pet}][1]★$m{pet_c}の転生の炎!$m{name}の$e2j{hp}が$v回復した<br>"; }, '', 1],
 	[115,	'ﾊﾞｯﾄﾝ',	'battle',	sub{ return if rand(2) > 1; my $v=int(rand(20)*(1+$m{pet_c}*0.025)+$m{pet_c}*5);    $m{hp}+=$v; $y{hp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の吸血!$y{name}の$e2j{hp}を$v奪った!<br>"; }, '', 1],
 	[116,	'ｳﾞｧﾝﾊﾟｲｱ',	'battle',	sub{ return if rand(4) > 1; my $v=int(rand(100)*(1+$m{pet_c}*0.025));   $m{hp}+=$v; $y{hp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の吸血!$y{name}の$e2j{hp}を$v奪った!<br>"; }, '', 1],
 	[117,	'ｻｷｭﾊﾞｽ',	'battle',	sub{ return if rand(4) > 1; my $v=int(rand(70)*(1+$m{pet_c}*0.1));    $m{mp}+=$v; $y{mp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の吸血!$y{name}の$e2j{mp}を$v奪った!<br>"; }, '', 1],
 	[118,	'ｽﾗｲﾑﾅｲﾄ',	'battle',	sub{ return if rand(2) > 1; my $v=int(rand(50)*(1+$m{pet_c}*0.05));                $y{hp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の攻撃!$y{name}に$vのﾀﾞﾒｰｼﾞを与えた!<br>"; }, '', 1],
 	[119,	'ｵﾒｶﾞ',		'battle',	sub{ return if rand(4) > 1; my $v=int(rand(400)*(1+$m{pet_c}*0.005));               $y{hp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の砲撃!$y{name}に$vのﾀﾞﾒｰｼﾞを与えた!<br>"; }, '', 1],
 	[120,	'ﾏｼﾞｯｸｽｶﾙ',	'battle',	sub{ return if rand(2) > 1; $m{mp}-=int(rand(10*(1+$m{pet_c}*0.05))+1); $y{mp}-=int(rand(30*(1+$m{pet_c}*0.5))+5);  $mes.="$pets[$m{pet}][1]★$m{pet_c}の怪しい霧!お互いの$e2j{mp}にﾀﾞﾒｰｼﾞ!<br>"; }, '', 1],
 	[121,	'ﾎﾟｲｽﾞﾝｿﾞﾝﾋﾞ','battle',	sub{ return if rand(2) > 1; if ($m{pet_c} < 10) { $m{hp}-=int((rand(10)*(1+$m{pet_c}*0.05)+5)); } $y{hp}-=int((rand(40)*(1+$m{pet_c})+15)); $mes.="$pets[$m{pet}][1]★$m{pet_c}の毒の息!お互いの$e2j{hp}にﾀﾞﾒｰｼﾞ!<br>"; },'残念でござったｗｗｗｗｵｳﾌｗｗｗｗ拙者これではまるでハズレみたいｗｗｗｗｗﾌｫｶﾇﾎﾟｳｗｗｗｗｗｗｗ', 1],
 	[122,	'ｳｨｻﾞｰﾄﾞ',	'battle',	sub{ return if rand(3-$m{pet_c}*0.1) > 1; $y{mp}=0; $mes.="$pets[$m{pet}][1]★$m{pet_c}の魔封じ!$y{name}の技が封じられた<br>"; },'<br>ｼｬﾊﾞﾄﾞｩﾋﾞﾀｯﾁﾍｰﾝｼｰﾝｗｗｗｗｼｬﾊﾞﾄﾞｩﾋﾞﾀｯﾁﾍｰﾝｼｰﾝｗｗｗｗ<br>ﾌﾚｲﾑｗｗｗﾌﾟﾘｰｽﾞｗｗｗﾋｰｗｗﾋｰｗｗﾋｰﾋｰﾋｰｗｗｗ<br>ﾗﾝﾄﾞｗｗｗﾌﾟﾘｰｽﾞｗｗｗﾄﾞｯｗｗﾄﾞｯﾄﾞｯｗｗﾄﾞｯﾄﾞｯﾄﾞﾝｗｗﾄﾞﾝｗｗﾄﾞｯﾄﾞｯﾄﾞﾝｗｗｗ<br>ﾊﾘｹｰﾝｗｗｗﾌﾟﾘｰｽﾞｗｗｗﾌｰｗｗﾌｰｗｗﾌｰﾌｰﾌｰｗｗｗﾌｰｗｗｗ<br>ｳｫｰﾀｰｗｗｗﾌﾟﾘｰｽﾞｗｗｗｽｨｰｗｗｽｨｰｗｗｗｽｨｰｗｗｗｗｽｨｰｗｗｗｗｗ<br>ﾁｮｰｲｲﾈｗｗｗｗｷｯｸｽﾄﾗｲｸｗｗｗｻｲｺｰｗｗｗｗｗｗ', 1],
 	[123,	'ｵｰﾃﾞｨﾝ',	'battle',	sub{ return if rand(5-$m{pet_c}*0.1) > 1; $y{hp}=0; $mes.="$pets[$m{pet}][1]★$m{pet_c}の斬鉄剣!!<br>"; }, '', 1],
 	[124,	'ﾃﾞｽ',		'battle',	sub{ return if rand(3-$m{pet_c}*0.1) > 1; $mes.="$pets[$m{pet}][1]★$m{pet_c}の死のﾙｰﾚｯﾄが廻り出した!ﾙｰﾚｯﾄは"; if (int(rand(2))==0) { $y{hp}=0; $mes.=$y{name} } else { $m{hp}=0; $mes.=$m{name}; } $mes.="を刺した!$pets[$m{pet}][1]★$m{pet_c}^-^<br>"; }, '', 1],
 
 # Ver0.9以降追加
 	[125,	'ﾑｰ',		'copy_pet',	sub{}], # main.cgi sedai交代埋め込み処理
 	[126,	'ｽﾘｰﾌﾟｼｰﾌﾟ','life_up',	sub{}], # login.cgi 自動削除に埋め込み処理
 	[127,	'ｱｵｲﾄﾘ',	'salary',	sub{ return if rand(7) > 1; my $v = int(rand($#eggs)+1); $mes.="なんと、$pets[$m{pet}][1]★$m{pet_c}が$eggs[$v][1]を産みました!<br>$eggs[$v][1]は預かり所へ送られました<br>"; &send_item($m{name}, 2, $v, 0, 0, 1); },'あのそーらへーわたーしはとぶー'],
 	[128,	'ﾏﾓﾉﾉﾀﾈｱｵ',	'myself',	sub{ return 1, 1 }],
 	[129,	'ﾏﾓﾉﾉﾀﾈｼﾛ',	'myself',	sub{ return 2, 1 }],
 	[130,	'ﾏﾓﾉﾉﾀﾈｱｶ',	'myself',	sub{ return 3, 1 }],
 
 # Ver1.58,Ver2.38以降追加
 	[131,	'ｳﾛﾎﾞﾛｽ',	'war_result',sub{ return if ($w{world} eq $#world_states-5); return if $m{value} < 1; $m{value} = 5; $mes.="$pets[$m{pet}][1]★$m{pet_c}の力が開放された!力を使い果たした$pets[$m{pet}][1]★$m{pet_c}は消えてしまった!<br>"; $m{pet}=0; $m{renzoku_c}=99 if $_[0] eq '0'; return 999, 1 }],
 	[132,	'ﾘﾎﾞﾝ',		'myself',	sub{ my $v = int(rand(5)+1); $m{medal} += $v; $mes.="$pets[$m{pet}][1]★$m{pet_c}から勲章を $v 個あたえられました<br>"; },'でちゅわ'],
 	[133,	'ｼﾞｬｯｸﾎﾟｯﾄ','myself',	sub{ my $v = int(1000*(int(rand(5))+1)); $m{coin} += $v; $mes.="$pets[$m{pet}][1]★$m{pet_c}を使いｶｼﾞﾉｺｲﾝを $v枚 手に入れました<br>"; }],
 	[134,	'ﾕﾀﾞ',		'myself',	sub{ if ($w{world} eq $#world_states) { require './lib/vs_npc.cgi'; return unless &is_move_npc_country; require './lib/move_player.cgi'; &move_player($m{name}, $m{country}, $w{country}); $m{country}=$w{country}; } else { return unless $m{country}; $m{rank_exp}=0; $m{rank}-=5; $m{rank}=1 if $m{rank} < 1; $mes.="$pets[$m{pet}][1]★$m{pet_c}の力により$m{name}の階級が下がりました<br>"; $y{country} = $m{country}; &add_prisoner; };	},'ｳﾛﾎﾞﾛｽ1個10万で買います'],
 	[135,	'ﾌｪﾝﾘﾙ',	'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; for my $i (1..$w{country}) { next if $cs{strong}[$i] < 500; next if $i eq $m{country}; $cs{strong}[$i] -= int(rand(300))+100; }; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い各国の$e2j{strong}が下がりました</b>");	}],
 	[136,	'ﾒﾃｵ',		'myself',	sub{ return unless $m{country}; return if ($w{world} eq '6') || ($w{world} eq '8'); my $rankup = (rand(10) < $m{pet_c}); for my $i (1..$w{country}) { for my $j ($i+1..$w{country}) { if (!($rankup && ($i eq $m{country} || $j eq $m{country}) && $w{"p_${i}_${j}"} eq '1')) {$w{"f_${i}_${j}"}=int(rand(20)); $w{"p_${i}_${j}"}=2;} } }; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い世界中が開戦となりました</b>");	}, '', 1],
 	[137,	'ﾍﾟｽﾄ',		'myself',	sub{ for my $i (1..$w{country}) { $cs{state}[$i] = 5; }; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い各国の$e2j{state}が $country_states[5] になりました</b>");	}],
 	[138,	'ﾍﾞﾙﾌｪｺﾞｰﾙ','myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; return if ($w{world} eq '17' || $w{world} eq $#world_states - 2 || $w{world} eq $#world_states - 3); $w{reset_time} = $time + 3600 * 4; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使ったことによりしばらく休戦となります</b>");	},'使うﾀｲﾐﾝｸﾞ考えろよ？'],
 	[139,	'ﾘｳﾞｧｲｱｻﾝ',	'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; &_pet_steal_country( 'strong',  int(rand(10)+10) * 100  ); &_pet_status_up('rank_exp', 50);	}],
 	[140,	'ﾍﾞﾙｾﾞﾌﾞﾙ',	'myself',	sub{ return unless $m{country}; &_pet_steal_country( 'food',	int(rand(10)+10) * 10000); &_pet_status_up('rank_exp', 50);	}],
 	[141,	'ﾏﾓﾝ',		'myself',	sub{ return unless $m{country}; &_pet_steal_country( 'money',	int(rand(10)+10) * 10000); &_pet_status_up('rank_exp', 50);	}],
 	[142,	'ｱｽﾓﾃﾞｳｽ',	'myself',	sub{ return unless $m{country}; &_pet_steal_country( 'soldier',	int(rand(10)+10) * 10000); &_pet_status_up('rank_exp', 50);	}],
 
 	[143,	'ﾂｸﾖﾐ',		'myself',	sub{ return unless $m{country}; $w{game_lv} -= 1; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い統一難易度が下がりました</b>");	},'KISS、したくなっちゃった…'],
 	[144,	'ｱﾎﾟﾛﾝ',	'myself',	sub{ return unless $m{country}; $w{game_lv} += 1; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い統一難易度が上がりました</b>");	}],
 	[145,	'ｱﾙｶﾄﾗｽﾞ',	'myself',	sub{ return unless $m{country}; &_pet_add_prisoner;	}],
 
 	[146,	'ｺｳﾒｲ',		'war_begin',sub{ $y{sol_lv} -= int(rand(10+$m{pet_c}*1.5)+10+$m{pet_c}*1.5); $mes.="$pets[$m{pet}][1]★$m{pet_c}の効果により敵の士気が下がりました<br>";	},'は、はわわ、ご主人様、敵が来ちゃいました！', 1],
 	[147,	'ﾄﾛｲ',		'war_begin',sub{ $m{turn} += 7 + int(rand($m{pet_c})); $mes.="$pets[$m{pet}][1]★$m{pet_c}の効果により限界ﾀｰﾝ数が増えました<br>";	}, '', 1],
 
 	[148,	'ﾀﾞｳﾝﾋﾙ',	'myself',	sub{ for my $k (qw/max_hp max_mp at df mat mdf ag lea cha/) { $m{$k} = int($m{$k} * 0.9) if $m{$k} > 50; }; $mes.="$pets[$m{pet}][1]★$m{pet_c}が$m{name}の全ｽﾃｰﾀｽを10%下げました<br>"; &_pet_status_up('exp', 500);	}],
 	[149,	'ﾐﾆﾓﾝ',		'myself',	sub{ my $v = int(rand(6)+1) * 10000; $mes.="$pets[$m{pet}][1]★$m{pet_c}が$m{name}のお金を $v G"; if (rand(2) < 1) { $m{money}-=$v; $mes.="減らしました(^w^)Ψ<br>"; } else { $m{money}+=$v; $mes.="増やしました(^w^)Ψ<br>"; }	},'金欲しいなら俺使うより<A Href="https://www.hellowork.go.jp/">ここ</A>いこう？なっ？'],
 	[150,	'ﾀﾞｰｸﾀｰﾄﾙ',	'speed_down',sub{},'いいよな、馬は人気で･･････。'], # war_form.cgiに埋め込み処理
 
 # Ver1.66,Ver2.46以降追加
 	[151,	'ｲｰｽﾀｰ',	'myself',	sub{ return unless $m{country}; return if ($w{world} eq $#world_states - 2 || $w{world} eq $#world_states - 3); for my $i (1..$w{country}) { $cs{is_die}[$i] = 0; }; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い全ての国が復興しました</b>");	}],
 	[152,	'ﾛｽﾀｲﾑ',	'myself',	sub{ return if ($w{world} eq $#world_states-5); return unless $m{country}; $w{limit_time} += 3600 * 12; &write_cs; &mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い統一期限が少し延びました</b>");	},'ままままだ慌てるような時間じゃない'],
 
 # Ver1.80, Ver2.60以降追加
 	[153,	'ﾗｽﾄｴｲｼﾞｽ',	'myself',	sub{ $m{lv}+=20; $m{lv}=99 if $m{lv} > 99; $mes.="$pets[$m{pet}][1]★$m{pet_c}の力により$m{name}のLvが上がりました<br>";	}],
 	[154,	'ﾍﾞﾋﾞｰﾄﾞﾗｺﾞﾝ','myself',	sub{ return if $m{sedai} > 3; &_pet_status_up('exp', 300) }],
 	[155,	'ﾊﾞﾙｷﾘｰ',	'battle',	sub{ return if $m{sedai} > 3; my $v = int($m_at * rand(0.6)); $y{hp}-=$v; $mes.="$pets[$m{pet}][1]★$m{pet_c}の攻撃!$y{name}に$vのﾀﾞﾒｰｼﾞを与えた!<br>"; }],
 	[156,	'ﾕﾆｺｰﾝ',	'battle',	sub{ return if $m{sedai} > 3; my $v = int($m{max_hp} * rand(0.3)); $m{hp}+=$v; $m{hp} = $m{max_hp} if $m{hp} > $m{max_hp}; $mes.="$pets[$m{pet}][1]★$m{pet_c}の魔力により!$m{name}の$e2j{hp}が$v回復しました<br>"; }],
 	[157,	'ﾍﾞﾋﾞｰﾅｲﾄ',	'salary',	sub{ return if $m{sedai} > 3; $m{exp}+=100; $mes.="$pets[$m{pet}][1]★$m{pet_c}の不思議な力によりLvが上がりました<br>"; }],
 	[158,	'ﾋﾟｸｼｰ',	'salary',	sub{ return if $m{sedai} > 3; $m{egg_c} += int(rand(50)+50) if $m{egg} }],
 	[159,	'ﾁｯﾌﾟ',		'training',	sub{ return if $m{sedai} > 3; my $v = int($_[0] * 10 * (rand(2)+1) ); $m{money}+=$v; $mes.="$v Gを手に入れました!<br>"; }],
 	[160,	'ﾁｮｳｱｲ',	'domestic',	sub{ return if $m{sedai} > 3; &special_money unless $w{world} eq '1'; }],
 	[161,	'ﾌｳﾏ',		'military',	sub{ return if $m{sedai} > 3; $m{rank_exp} += int($_[0]*0.5); $mes.="$pets[$m{pet}][1]★$m{pet_c}の力により $e2j{rank_exp} が多くあたえられました<br>"; }],
 	[162,	'ｽｻﾉｵ',		'war_begin',sub{ return if $m{sedai} > 3; $m{sol_lv} = 100; $y{sol_lv} = 50; $mes.="$pets[$m{pet}][1]★$m{pet_c}の効果により自軍の士気が上がり、敵軍の士気が下がりました<br>";	}],
 	[163,	'ｸﾛﾑ',		'war_win',	sub{ return if $m{sedai} > 3; ++$m{medal} }],
 	
 	[164,	'ｴﾛｽ',		'marriage',	sub{},'なぁ…ｽｹﾍﾞしようや……'], # shopping_marriage.cgiに埋め込み処理
 	[165,	'ﾀﾅﾄｽ',		'hunt_lv',	sub{}], # hunting.cgiに埋め込み処理
 	[166,	'ﾕﾘ',		'marriage_y',	sub{},'キマシタワー', 1], # shopping_marriage.cgiに埋め込み処理
 	[167,	'ﾊﾞﾗ',		'marriage_b',	sub{},'やらないか', 1], # shopping_marriage.cgiに埋め込み処理
 	[168,	'ﾍﾟｲﾝﾀｰ',		'myself',	sub{},'ね、簡単でしょ？'],
 	[169,	'ﾁｷﾝ',		'no_single',	sub{}],
 	[170,	'ﾌﾞﾚｲﾌﾞﾊｰﾄ',		'ambush_single',	sub{}],
 	[171,	'ﾐﾙｸ',		'myself',	sub{$m{hp} = $m{max_hp}; $m{mp} = $m{max_mp}; &_random_up if $m{pet_c} > rand(20);}, '', 1],
 	[172,	'ﾅｰｽ',		'hospital',	sub{ $mes.="$pets[$m{pet}][1]★$m{pet_c}の効果で治療費が半額になりました<br>"; return $_[0] * (0.5 - $m{pet_c} * 0.025), 1; }, '', 1],
 	[173,	'ﾄﾞｸﾄﾙ',		'heal_up',	sub{return $_[0] * (2 + $m{pet_c}), 1;}, '', 1],
 	[174,	'ﾎﾞｯﾁ',		'no_rescue',	sub{}],
 	[175,	'ｶﾞﾊｸ',		'myself',	sub{}],# trick.cgiに埋め込み処理
 	[176,	'ﾜﾛｽ',		'myself',	sub{}],# trick.cgiに埋め込み処理
 	[177,	'ﾓｼﾓ',		'myself',	sub{},'よぉ、、、', 1],# prison.cgiに埋め込み処理
 	[178,	'ｵﾎｶﾑﾂﾞﾐ',		'escape',	sub{&c_up('esc_c'); &_pet_c_bonus for (1..5); }, '', 1],
 	[179,	'ﾀﾁﾞｶﾗｵ',		'rescue',	sub{&c_up('res_c'); &_pet_c_bonus for (1..5); }, '', 1],
 	[180,	'ｴｯｸﾞﾏﾝ',	'myself',	sub{ &_pet_eggman(0,53,53,53,26..36,48..51) }, '', 1], # ﾀﾏｺﾞに変化ﾀﾏｺﾞのNo
 	[181,	'ｴｯｸﾞﾋｰﾛｰ',	'myself',	sub{ &_pet_eggman(0,53,53,53,37..41,43..47) }, '', 1], # ﾀﾏｺﾞに変化ﾀﾏｺﾞのNo
 	[182,	'ﾀﾞﾂｾﾞｲ',	'tax_free',	sub{}], # main.cgiに埋め込み処理
 	[183,	'ﾀｸﾐ',	'myself',	sub{ ++$m{depot_bonus}; $mes .= "なんということでしょうﾀｸﾐのﾘﾌｫｰﾑにより<br>あんなに狭かった預り所が少し広くなりました<br>";},'収納！収納！！'],
 	[184,	'ﾚﾝｼﾞ',	'myself',	sub{ if($m{egg}){ $m{egg_c} += int(rand(50) * (1 + $m{pet_c} * 0.5)) + 50; $mes.="ﾚﾝｼﾞを使い卵の孵化値が増えた<br>";}}, '', 1],
 	[185,	'ｻｷﾞ',	'myself',	sub{}],# trick.cgiに埋め込み処理
 	[186,	'ｻﾙｸﾞﾂﾜ',	'myself',	sub{}],# trick.cgiに埋め込み処理
 	[187,	'ﾊﾟﾙﾌﾟﾝﾃ',	'myself',	sub{ return if ($w{world} eq $#world_states-5); &_pet_random();}],
 	[188,	'ﾍｯﾄﾞﾊﾝﾄ',	'myself',	sub{}],# 処理が似ているのでtrick.cgiに埋め込み処理
 	[189,	'ﾒｶﾞﾎﾝ',	'myself',	sub{}],# 処理が似ているのでtrick.cgiに埋め込み処理
 	[190,	'ｱﾘﾖｼ',	'myself',	sub{},'おしゃべりクソ野郎'],# trick.cgiに埋め込み処理
 	[191,	'ﾃﾝﾁﾄﾋﾄﾂ',	'myself',	sub{}],# 処理が似ているのでtrick.cgiに埋め込み処理
	[192,	'ﾊﾟﾗﾃﾞｨﾝ',			'lv_up',	sub{ ++$m{$_} for (qw/max_hp max_mp/);		$mes .= qq|<br><font color="#CC00FF">$e2j{hp}+1 $e2j{mp}+1 </font>|; }],
	[193,	'ﾀﾞｰｸﾗﾋﾞｯﾄ',	'war_result',sub{ return if (rand(1000) < 600 + $m{pet_c} * $m{pet_c}); $mes.="$pets[$m{pet}][1]★$m{pet_c}の力が開放された!力を使い果たした$pets[$m{pet}][1]★$m{pet_c}は消えてしまった!<br>"; $m{pet}=0; $m{renzoku_c}=99 if $_[0] eq '0';}, 'あぁ^～心がぴょんぴょんするんじゃぁ^～', 1],
 	[194,	'ﾈｸﾛﾏﾝｻｰ',	'salary',	sub{ &_pet_summon(int(rand(16807)));},'夜、一人では遊ばないでください。'],
 	[195,	'ﾈｸﾛﾏｿｻｰ',	'salary',	sub{ &_pet_summon(99999);},'自分まだ見習いなので･･･さーせんｗｗｗ'],
 	[196,	'ｸﾏﾖｹ',	'no_boss',	sub{}, '', 1],# hunting.cgiに埋め込み処理
 	[197,	'ｴｽｹｰﾌﾟｺﾞｰﾄ','life_down',	sub{}], # login.cgi 自動削除に埋め込み処理
 	[198,	'ｶｼﾗ',	'myself',	sub{}],# trick.cgiに埋め込み処理
 	[199,	'ｳﾘｴﾙ',	'change_seed',	sub{},'やっと4柱そろいました'], # main.cgiのsub lv_upに直接埋め込み処理
 	[200,	'ｹｯﾄｳ',	'keep_seed',	sub{},'決闘（デュエル）!'], # main.cgiのsub lv_upに直接埋め込み処理
 	[201,	'ﾎｰﾘｴ',	'myself',	sub{},'回転回転回転回転ライブドアオート'],# trick.cgiに埋め込み処理
 );
 
 
 
 #=================================================
 # ﾍﾟｯﾄｻﾌﾞﾙｰﾁﾝ
 #=================================================
 sub use_pet {
 	my($k, $v) = @_;
 	if ( $pets[$m{pet}][2] eq $k ) {
 		my($return_value, $is_return) = $pets[$m{pet}][3]->($v);
 		return $is_return ? int($return_value) : $v;
 	}
 	return $v;
 }
 sub _random_up {
 	my @random_c_set = (
	 	['exp', 100],
	 	['exp', 200],
	 	['exp', 500],
	 	['rank_exp', 200],
	 	['rank_exp', 400],
	 	['rank_exp', 800],
	 	['max_hp', 10],
	 	['max_hp', 20],
	 	['max_hp', 40],
	 	['max_mp', 10],
	 	['max_mp', 20],
	 	['max_mp', 40],
	 	['at', 5],
	 	['at', 15],
	 	['at', 30],
	 	['df', 5],
	 	['df', 15],
	 	['df', 30],
	 	['mat', 5],
	 	['mat', 15],
	 	['mat', 30],
	 	['mdf', 5],
	 	['mdf', 15],
	 	['mdf', 30],
	 	['ag', 5],
	 	['ag', 15],
	 	['ag', 30],
	 	['lea', 5],
	 	['lea', 15],
	 	['lea', 30],
	 	['cha', 5],
	 	['cha', 15],
	 	['cha', 30]
 	);
 	my $rand_i = int(rand(@random_c_set));
 	&_pet_status_up($random_c_set[$rand_i][0], $random_c_set[$rand_i][1]);
 }
 sub _pet_status_up {
 	my($k,$v) = @_;
 	$m{$k} += $v;
 	$m{$k . '_org'} += $v;
 	$mes.="$pets[$m{pet}][1]★$m{pet_c}から力をあたえられ、$m{name}の$e2j{$k}が$v上がった<br>";
 }
 sub _pet_weapon {
 	my @borns = @_;
 	my $v = $borns[int(rand(@borns))];
 	$mes.="$pets[$m{pet}][1]★$m{pet_c}は$weas[$v][1]に形を変えた!<br>$weas[$v][1]は預かり所に送られました<br>";
 	&send_item($m{name}, 1, $v, 0, $m{pet_c}, 1);
 }
 sub _pet_eggman {
 	my @borns = @_;
 	my $v = $borns[int(rand(@borns))];
 	$mes .= "$pets[$m{pet}][1]★$m{pet_c}は全ての力を解き放った!!<br>なんと…$pets[$m{pet}][1]★$m{pet_c}は";
 	if ($v eq '0') {
 		$mes.="そのまま消滅してしまった…<br>";
 	}
 	else {
 		$mes.="$eggs[$v][1]に形を変えた!<br>$eggs[$v][1]は預かり所に送られました<br>";
 		&send_item($m{name}, 2, $v, $m{pet_c} * 50, 0, 1);
 	}
 }
 sub _pet_sedai_job {
 	my @nos = @_;
 	my $no = $nos[0];
 	if ($m{pet_c} > rand(20)) {
 		$no = $nos[1];
 	}
 	$m{job} = $no;
 	$mes .= "$pets[$m{pet}][1]★$m{pet_c}の力で $m{name} の職業が $jobs[$no][1]になりました<br>";
 	$mes .= "役目を終えた $pets[$m{pet}][1]★$m{pet_c} は光の彼方へ消えていった…<br>";
 	$m{pet} = 0;
 }
 
 sub _pet_steal_country {
 	my($k,$v) = &_steal_country(@_);
 	&mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い$cs{name}[$y{country}]の$e2j{$k}を $v 奪いました</b>");
 	&write_world_news("$c_mの$m{name}が$pets[$m{pet}][1]★$m{pet_c}を使ったことによる罪で$cs{name}[$y{country}]の牢獄に幽閉されました");
 	&add_prisoner;
 }
 
 sub _steal_country {
 	my($k,$v) = @_;
 
 	my $max_value = $cs{$k}[1];
 	$y{country} = 1;
 	for my $i (2 .. $w{country}) {
 		if ($cs{$k}[$i] > $max_value) {
 			$y{country} = $i;
 			$max_value = $cs{$k}[$i];
 		}
 	}
 	
 	$v = $cs{$k}[$y{country}] if $v > $cs{$k}[$y{country}];
 	$cs{$k}[$y{country}] -= $v;
 	$cs{$k}[$m{country}] += $v unless $y{country} eq $m{country};
 	&write_cs;
 	
 	return ($k, $v);
 }
 
 sub _pet_add_prisoner {
 	my @ks = (qw/war dom pro mil ceo/);
 	my $k = $ks[int(rand(@ks))];
 
 	for my $i (1 .. $w{country}) {
 		next if $cs{$k}[$i] eq '';
 		next if $i eq $m{country};
 		
 		&regist_you_data($cs{$k}[$i], 'lib', 'prison');
 		&regist_you_data($cs{$k}[$i], 'tp', 100);
 		&regist_you_data($cs{$k}[$i], 'y_country',  $m{country});
 		&regist_you_data($cs{$k}[$i], 'wt', $GWT * 60);
 		&regist_you_data($cs{$k}[$i], 'act', 0);
 		
 		open my $fh, ">> $logdir/$m{country}/prisoner.cgi" or &error("$logdir/$m{country}/prisoner.cgi が開けません");
 		print $fh "$cs{$k}[$i]<>$i<>\n";
 		close $fh;
 	}
 	&mes_and_world_news("<b>$pets[$m{pet}][1]★$m{pet_c}を使い各国の $e2j{$k} が$c_mの牢獄に幽閉されました</b>");
 	
 	$y{country} = $m{country};
 	&add_prisoner;
 }
 
 sub _pet_random {
	require "$datadir/parupunte.cgi";
	if ($w{world} ne '1') {
		&{$effects[int(rand(@effects))]};
	} else {
		&{$effects[2]};
	}
}
 
sub _pet_summon {
	my $rank_p = shift;
	my @pet_ss = (62, 63, 139, 64, 135, 188);
	my @pet_s = (61, 65..71, 77, 80, 83, 86, 89, 92, 95, 98, 101, 104, 107, 110, 131, 136..138, 140..145, 151, 152, 181, 187);
	my @pet_a = (76, 79, 82, 85, 88, 91, 94, 97, 100, 103, 106, 109, 132, 128..130, 180, 184);
	my @pet_b = (78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 153);
	my @pet_c = (133, 134, 148, 149, 171, 175, 176, 185, 189, 190);
	my @pet_x = (120, 121, 124, 165);
	my $v;
	if($rank_p > 2400){
		$v = $pet_x[int(rand(@pet_x))];
	}elsif($rank_p > 342){
		$v = $pet_c[int(rand(@pet_c))];
	}elsif($rank_p > 48){
		$v = $pet_b[int(rand(@pet_b))];
	}elsif($rank_p > 6){
		$v = $pet_a[int(rand(@pet_a))];
	}elsif($rank_p > 0){
		$v = $pet_s[int(rand(@pet_s))];
	}else{
		$v = $pet_ss[int(rand(@pet_ss))];
	}

	$mes.="なんと、$pets[$m{pet}][1]★$m{pet_c}が$pets[$v][1]を召喚しました!<br>$pets[$v][1]は預かり所へ送られました<br>";
	&send_item($m{name}, 3, $v, 0, 0, 1);
	if (rand(10) < 1){
		$m{pet} = 0;
		$mes .= "ﾈｸﾛﾏﾝｻｰ＜疲れたから帰る";
	}
}
 
sub _pet_c_bonus {
	if (rand(500) < $m{pet_c} * $m{pet_c}) {
		$mes .= "なんと追加で支援金 3000 G をもらいました";
		$m{money} += 3000;
	}
}
 
sub _pet_lv_up {
	my $sta = shift;
	my $v = 1;
	$v++ if ($m{pet_c} > rand(10));
	$v++ if ($m{pet_c} - 10 > rand(10));
	$m{$sta} += $v;
	$mes .= qq|<br><font color="#CC00FF">$e2j{$sta}+$v</font>|;
}

 1; # 削除不可
 