1343388622<>7/27 20:30<>さぶれ<>6<><>221.79.146.195<>求）ﾍﾟｲﾝﾀｰ×3 or ﾍﾟｲﾝﾀｰ×2+α<br>出）ﾑｰ<br><br>交渉可<>8347838a8349208dec3a836a8383838b8e71.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343367169<>7/27 14:32<>すけろく<>6<>0<>219.107.54.247<>出)夢<br>求)8万<br><br>8個まであり<br>手紙ください<>82d382a7815b82a682ce815b208dec3a82b782af82eb82ad.jpeg<>0<>0<>1<>＠７(すけろく)<>以降のレスはありません<><><><>
1343361490<>7/27 12:58<>袁世凱<>7<>★最終兵器<>202.253.99.148<>お店 北洋軍閥に 孵化夢10万安くした<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343355883<>7/27 11:24<>じゃが<>4<>0<>58.93.190.112<>出）夢卵　求）8万<br>出）？卵　求）20万<br><br>複数個あります。お手紙ください。<>82c782f182b582e382af208dec3a838c839483428341835e8393.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343355098<>7/27 11:11<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>出）5万<br>求）シーザー<br><br>出）70万<br>求）神卵<br>お手紙ください<>8347838a8369208dec3a90d48c8e.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343308362<>7/26 22:12<>にゃにゃもし<>8<>せっかち<>202.229.177.48<>出ゴースト  ガブリエル<br>求ｱﾙｶﾄﾗｽﾞ3つ   6つ<>83898393834e838b8358208dec3a90d48c8e.jpeg<>0<>0<>1<>出ﾂｸﾖﾐ 求ｱﾙｶﾄﾗｽﾞ(にゃにゃもし)<>以降のレスはありません<><><><>
1343278651<>7/26 13:57<>空気嫁<>5<>★魔王<>1.72.0.172<>出】ﾊﾞﾗ<br>求】ﾕﾘ<br><br>お手紙待ってますー<>968289a4208dec3a8bf38b4389c5.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343262055<>7/26 09:20<>カエル<>6<>働けｱｷﾚｽ<>1.75.229.194<>求)ﾀｸﾐ*2　出)ｶﾞﾌﾞﾘｴﾙ+ﾏｰﾒｲﾄﾞ <br>求)ﾀｸﾐ 　 出)ﾍﾟｲﾝﾀｰ+ﾏｰﾒｲﾄﾞ<br>求)ﾀｸﾐ 　 出)ﾀﾞｰｸﾎｰｽ+ﾏｰﾒｲﾄﾞ <br>求)ﾀｸﾐ 　 出)ﾏｰﾒｲﾄﾞ*2 <br>求)武器　 出)金(詳細は日記にて)<br> <br><br>ｱｲｺﾝ募集各40万に値上げ。ご指摘ありがとうです。さらに価格交渉可。お手紙下さい。<br>・ｱﾑﾈｼﾞｱ 庚夕子 <br>・ﾋﾟﾝﾄﾞﾗ 高倉陽毬(ﾍﾟﾝｷﾞﾝVer) <br>・屋上姫 霞上澄花<>8341838b834a815b8368208dec3a8352836e838b.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343252120<>7/26 06:35<>そぉい！<>0<>逃亡者<>182.249.242.135<>求）孵化夢<br>出）夢3<br><br>求）孵化ﾊﾃﾅ<br>出）ﾊﾃﾅ2＋夢1<br><br>投げつけOK<>94bc91b3208dec3a90d48c8e.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343229971<>7/26 00:26<>KRG<>1<><>111.86.141.138<>たまご割り代行募集<br>手紙ください<br><br><br>売)ｺﾞｰｽﾄｷﾝｸﾞ<br>値段手紙ください <br> <br>求孵化夢卵 <br>出夢卵３つ<>4b5247208dec3a835882c882f182c682a9.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343225907<>7/25 23:18<>かぜまる<>2<>☆熱いぜ!!<>124.84.224.25<>お店に卵を置きました<br>是非おこしください<>6b617a656d617275208dec3a82a982ba82dc82e9.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343191820<>7/25 13:50<>ﾅﾏ<>5<><>223.133.123.145<>結婚相手募集。ﾊﾞﾗ婚可、先着順。<br>手紙ください。<>90b68372815b838b208dec3ac5cf.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343189721<>7/25 13:15<>tomy<>2<>★英雄<>111.107.116.72<>tomy店openしましたV(^-^)V  品物は少ないけど、安くしてるので、買ってね～♪<>0<>0<>0<>1<>以降のレスはありません<><><><><>
1343138269<>7/24 22:57<>おいいういい<>6<>★ざわ…ざわ…<>114.134.209.123<>求）夢・？卵(950↑/999)<br>出）同種卵×2＋15万G<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
1343064907<>7/24 02:35<>アグリ２世<>4<>★教祖様<>123.108.237.120<>孵化卵（プラチナ・夢など）<br>能力up系置きました<br>よろしくお願いします<br><br>２世本店<>0<>0<>0<>1<>以降のレスはありません<><><><><>
1343047858<>7/23 21:50<>まりさみ<>3<><>122.26.37.53<>絵のお店のソウルイーター値下げしました<br><br>あとデフォルトアイコンに全東方キャラクターをぶちこんでおきました<br>興味のある方は見てみてくださいな<>835783858341208dec3a82dc82e882b382dd.jpeg<>0<>0<>1<>以降のレスはありません<><><><><>
