1310081495<>7/8 08:31<>やましろう<>2<>★ゲイツ<>111.86.141.196<>結婚〆です<br>お手紙は一番最初の方を優先しました<br>後からお手紙送ってくれた方申し訳ありませんでした<>_add_31333038373532353035208dec3a82e282dc82b582eb82a4<>
1310060737<>7/8 02:45<>ルイズ<>5<>★教祖様<>202.229.177.144<>↓〆です<>834e8393834a834e8393834a208dec3a82d882eb82d882eb.jpeg<>
1310060443<>7/8 02:40<>のどごしNo.1<>5<>貴族<>202.229.176.19<>↓〆<>_add_31333035343632323838208dec3a6161616161<>
1310059278<>7/8 02:21<>ゴミクズ<>5<><>118.159.133.210<>〆<>834c836d208dec3a82a482a882cc82df.jpeg<>
1310058994<>7/8 02:16<>ゴミクズ<>5<><>118.159.133.218<>出)孵化値超え夢卵3個、夢卵3個<br><br>求)ロキ<>834c836d208dec3a82a482a882cc82df.jpeg<>
1310055447<>7/8 01:17<>派遣社員<>2<>ハンター<>106.149.242.242<>〆です<br>ご購入ありがとうございました<>94688cad82b382f182d6208dec3a948e97ed97ec96b2.jpeg<>
1310054657<>7/8 01:04<>派遣社員<>2<>ハンター<>106.149.242.242<>出）ｹﾞﾛﾉﾀﾈ<br>求）350万<>94688cad82b382f182d6208dec3a948e97ed97ec96b2.jpeg<>
1310054612<>7/8 01:03<>ｱｽﾐﾝｺﾞｽ<>5<>★ルパン<>111.86.143.47<>〆<>8f4582a231208dec3a82d882eb82d882eb.jpeg<>
1310053973<>7/8 00:52<>ｱｽﾐﾝｺﾞｽ<>5<>★ルパン<>111.86.143.45<>求）ﾗｯｷｰ<br><br>出）50万orｴﾋﾞｽ×2<br><br>足りなければ交渉次第で追加します。手紙くだしあ<>8f4582a231208dec3a82d882eb82d882eb.jpeg<>
1310051399<>7/8 00:09<>炭酸水素Na<>6<><>122.26.32.103<>〆ます<>82ce82e782b782a1815b208dec3a837d837483428393.jpeg<>
1310051027<>7/8 00:03<>だんご<>7<><>202.229.178.9<>フレイム〆<>82a882c282e8208dec3a82b282dc96fb.jpeg<>
1310050819<>7/8 00:00<>だんご<>7<><>202.229.178.10<>出)フレイム☆２９<br>求)１０万<br><br>出)３５万<br>求)ウロボロス<br>ウロボロスは４つまで募集します<>82a882c282e8208dec3a82b282dc96fb.jpeg<>
1310050685<>7/7 23:58<>炭酸水素Na<>6<><>122.26.32.103<>出)ｹﾞﾛｴｯｸﾞ求)200万<>82ce82e782b782a1815b208dec3a837d837483428393.jpeg<>
1310049402<>7/7 23:36<>ルセア<>7<>★一騎当千<>118.159.133.5<>宣伝でのﾂｸﾖﾐは〆<br><br>日記にてペット販売中です<br>よかったら見て下さい<>928d95b682cc9569208dec3a83548375838a8369.jpeg<>
1310048680<>7/7 23:24<>クー<>1<><>111.86.141.80<>お嫁さん募集します、プロポ台は此方で負担します<br><br>気軽にお手紙下さい<>_add_8ae791a02889bc29208dec3a83548375838a8369.jpeg<>
1310048150<>7/7 23:15<>ルイズ<>5<>★教祖様<>124.146.175.169<>求）ロキ<br>出）35万<br>お手紙ください<>834e8393834a834e8393834a208dec3a82d882eb82d882eb.jpeg<>
1310046893<>7/7 22:54<>のどごしNo.1<>5<>貴族<>202.229.176.50<>出)ｻﾙｸﾞﾂﾜ<br>求)50万<br><br>お手紙待ってます<>_add_31333035343632323838208dec3a6161616161<>
1310046771<>7/7 22:52<>やましろう<>2<>★ゲイツ<>111.86.141.195<>お嫁さん募集中です<br>バラ持ち旦那さんでもokです<br>バラは２つあるので必要であれば送ります<br>プロポ代はこちらが負担します<br>お手紙よろしくです<>_add_31333038373532353035208dec3a82e282dc82b582eb82a4<>
1310046768<>7/7 22:52<>詩音<>3<><>202.253.96.229<>しめ<>8e8d89b9208dec3a948e97ed97ec96b2.jpeg<>
1310045855<>7/7 22:37<>白でっていう<>7<>特攻隊長<>218.225.242.235<>一旦〆<>83778343837a815b816990c2816a208dec3a82b382f182be82c8.jpeg<>
1310045033<>7/7 22:23<>pareca<>4<>ニート<>113.147.135.36<>↓流れたので一旦〆<>000.gif<>
1310043111<>7/7 21:51<>ばいかる<>5<>★堕天使†<>202.229.176.52<>求 ｼﾙﾊﾞｰｴｯｸﾞ<br>出 20万<br><br>複数募集<>93a18b7b997a208dec3a96b294549796.jpeg<>
1310042927<>7/7 21:48<>さんかくさん<>5<>修行僧<>123.108.237.21<>しめ<>82dd815b82b182bd82f1208dec3a72656f6e363331.jpeg<>
1310042693<>7/7 21:44<>さんかくさん<>5<>修行僧<>123.108.237.25<>出 ﾛｷ<br>求 35万<br>手軽下さい交渉うけます<>82dd815b82b182bd82f1208dec3a72656f6e363331.jpeg<>
1310041349<>7/7 21:22<>雪比奈<>1<>0<>123.108.237.27<>〆<>_add_838a8371835e815b208dec3a8149814881638142.jpeg<>
1310040494<>7/7 21:08<>松平元康<>1<><>202.253.96.230<>求）パルプンテ<br><br>出）５０万<br><br>手紙下さい<>9387936394fc946728c4dabd29208dec3a834e838a83588373815b.jpeg<>
1310040421<>7/7 21:07<>詩音<>3<><>202.253.96.229<>再び募集<br>求)孵化寸前夢卵<br>出)35万<br>お手紙くださいなー<>8e8d89b9208dec3a948e97ed97ec96b2.jpeg<>
1310040012<>7/7 21:00<>雪比奈<>1<>0<>123.108.237.25<>出 孵化寸前夢卵<br><br>求 夢卵三つ<br><br>手紙ください<>_add_838a8371835e815b208dec3a8149814881638142.jpeg<>
1310038446<>7/7 20:34<>ユアン<>3<><>119.238.64.253<>結婚〆<>8be0208dec3a82b582ab82dd.jpeg<>
1310037950<>7/7 20:25<>ルセア<>7<>★一騎当千<>118.159.133.14<>出）ﾂｸﾖﾐ<br>求）35万<br><br>５個まであります<br>全部まとめ買いして下さるなら、160万にオマケいたします<br><br>お手紙待ってます<>928d95b682cc9569208dec3a83548375838a8369.jpeg<>
1310036396<>7/7 19:59<>白でっていう<>7<>特攻隊長<>218.225.242.235<>求)孵化寸前夢卵<br>出)31万G<br><br>売ってもいいって方はお手紙くださいな<>83778343837a815b816990c2816a208dec3a82b382f182be82c8.jpeg<>
1310035864<>7/7 19:51<>pareca<>4<>ニート<>113.147.135.36<>求)ｺﾞｰｽﾄ<br>出)350万<br><br>手紙お願いします<>000.gif<>
1310035191<>7/7 19:39<>詩音<>3<><>202.253.96.229<>しめ<>8e8d89b9208dec3a948e97ed97ec96b2.jpeg<>
1310034853<>7/7 19:34<>rauf<>3<><>222.5.62.178<>出）ｱﾋﾞﾘﾃｨｴｯｸﾞ(797/800)<br>求）ｱﾋﾞﾘﾃｨｴｯｸﾞ×３<br><br>手紙待ってます<>000.gif<>
1310034486<>7/7 19:28<>ﾃﾞｵｷｼﾘﾎﾞ核酸<>5<>門番<>61.215.141.74<>下記〆ます<>cdd9bddeb4ddbcdeaad9208dec3a926390ee90e5906c8fb6.jpeg<>
1310034423<>7/7 19:27<>詩音<>3<><>202.253.96.229<>求)孵化寸前夢卵<br>出)30万<br>手紙ください<>8e8d89b9208dec3a948e97ed97ec96b2.jpeg<>
1310033028<>7/7 19:03<>ユアン<>3<><>119.238.64.253<>旦那募集<br>手紙ください<>8be0208dec3a82b582ab82dd.jpeg<>
1310031888<>7/7 18:44<>Subway<>6<>★堕天使†<>222.5.63.203<>〆<>8941977a208dec3a82bf82c682b9.jpeg<>
1310031887<>7/7 18:44<>糞味噌<>1<><>111.86.142.22<>↓締め<>8ae72895b396a191588dec29208dec3a6b61657275303032.jpeg<>
1310031480<>7/7 18:38<>Subway<>6<>★堕天使†<>222.5.63.194<>出)孵化寸前？卵<br>求)？卵３つor６０万<br><br>お手紙下さい<>8941977a208dec3a82bf82c682b9.jpeg<>
1310031343<>7/7 18:35<>NORTH<>2<>★名門<>126.26.152.224<>〆<>82e882e382a482e682a4208dec3ab5bcdeb0b5bddecedeb0dd.jpeg<>
1310031172<>7/7 18:32<>糞味噌<>1<><>111.86.142.25<>夢卵1つ10万で買います。10個まで募集、手紙下さい<>8ae72895b396a191588dec29208dec3a6b61657275303032.jpeg<>
1310030584<>7/7 18:23<>ユッキー<>6<><>218.219.197.248<>〆<>82a082a082a0208dec3a8345836a.jpeg<>
1310029513<>7/7 18:05<>hinenoya<>7<>★東方不敗<>118.5.19.198<>↓ﾀﾈｱｶ〆<>82ae82e982ae82e991be977a208dec3a68696e656e6f7961.jpeg<>
1310029042<>7/7 17:57<>hinenoya<>7<>★東方不敗<>118.5.19.198<>出)ﾏﾓﾉﾉﾀﾈｱｶ<br>求)15万G<br><br>お手紙ください<>82ae82e982ae82e991be977a208dec3a68696e656e6f7961.jpeg<>
1310029014<>7/7 17:56<>ユッキー<>6<><>218.219.197.248<>↓変更<br>出)ペインター<br>求)ダークホース<br>お手紙ください<>82a082a082a0208dec3a8345836a.jpeg<>
1310028626<>7/7 17:50<>ホライゾン<>4<>★奥義師範<>114.134.198.98<>求　ｱﾋﾞﾘﾃｨｴｯｸﾞ<br>出　10万<>82c982e282e8208dec3a837a83898343835d8393.jpeg<>
1310028618<>7/7 17:50<>ゲロ鍵<>2<>★ペルソナ<>202.229.177.39<>求)ｺﾞｰｽﾄ<br> <br>出)330万<br> <br>よろしゅうなう<br><>8efa906c208dec3a834a8343835b838b9545.jpeg<>
1310028519<>7/7 17:48<>やましろう<>2<>★ゲイツ<>111.86.141.201<>求)嫁<br><br>出)旦那<br><br>お手紙よろしくっす<>_add_31333038373532353035208dec3a82e282dc82b582eb82a4<>
1310028213<>7/7 17:43<>ハイラ<>1<>★堕天使†<>124.146.175.174<>下記〆ます～<>8370838b83588342208dec3a836e83438389.jpeg<>
