1343391847<>7/27 21:24<>冷し中華<>3<><>221.187.210.253<>NPCおかしいやろ…<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391694<>7/27 21:21<>冷し中華<>3<><>221.187.210.253<>まあ出来るだけ普通に戦争やって勝ちたい<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391678<>7/27 21:21<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>支援国の中では1番国力があるのでオーバーキル前に滅亡されないようにほどほどに戦争しますね<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343391401<>7/27 21:16<>冷し中華<>3<><>221.187.210.253<>今で統一国力と4万差だから<br>一斉が通れば安全圏にいけそうだけど<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391330<>7/27 21:15<>poppo<>2<>★友愛<>202.229.177.15<>手紙の通りならﾍﾞﾙﾌｪもありだけどなんかなー<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343391190<>7/27 21:13<>七角<>2<><>118.159.132.166<>ようやく居なくなったか…<br>居た方が多分邪魔だったけど<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343391154<>7/27 21:12<>冷し中華<>3<><>221.187.210.253<>「暗黒が21時発なら21時44分分にﾍﾞﾙﾌｪ撃ちたい」って思ってしまった<br>ﾍﾞﾙﾌｪ持ってないけど<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391150<>7/27 21:12<>poppo<>2<>★友愛<>202.229.177.15<>やっと同盟するのか<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343391112<>7/27 21:11<>七角<>2<><>118.159.132.171<>戦争ｶｳﾝﾀｰさんのご機嫌次第でかなり差がでる<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343391082<>7/27 21:11<>クリスピー<>1<>ニート<>210.198.80.130<>名残惜しいがお別れです　アデュー<>91668ae7208dec3a82ae82e782c182bf82a5.jpeg<>
1343390797<>7/27 21:06<>冷し中華<>3<><>221.187.210.253<>暗黒の国力が4万切るまでに<br>どれくらい時間かかるだろ<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390618<>7/27 21:03<>poppo<>2<>★友愛<>202.229.177.15<>支援国もう一度滅ぼした方がいいかな<br>それこそオーバーキル狙いでも<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343390607<>7/27 21:03<>七角<>2<><>118.159.132.177<>ぶっ飛ばされたぜー<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343390559<>7/27 21:02<>黒豚<>3<>ぶー<>114.69.43.55<>やーっと動いたか<>82d282f182ad82d482bd208dec3a8d9593d8.jpeg<>
1343390533<>7/27 21:02<>poppo<>2<>★友愛<>202.229.177.14<>あらあら<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343390470<>7/27 21:01<>七角<>2<><>118.159.132.177<>流石にブラフじゃ…<br>ｲｰｽﾀｰきたー<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343390058<>7/27 20:54<>クヌルプ<>6<><>111.86.143.238<>ほう<>8db2815896d8834a8389837d838d8358208dec3a837a83898343835d8393.jpeg<>
1343390000<>7/27 20:53<>キノ<>3<>コンプガチャ(笑)<>126.29.211.5<>原発の会議室の情報をいくつか盗み聞きできた<br>い<br>あ<br>あ、そういえば９時ぴったりにイースターお願いします<br>あと兵士が足りないかもだからマルスとかないかな？<br><>834c836d81698a778980816a208dec3a834c836d.jpeg<>
1343388774<>7/27 20:32<>緋翠<>4<><>124.146.175.230<>みす<>83498362836883418343208dec3a94ea9089.jpeg<>
1343388759<>7/27 20:32<>緋翠<>4<><>124.146.175.230<>大丈夫サンクス！<br><>83498362836883418343208dec3a94ea9089.jpeg<>
1343388717<>7/27 20:31<>冷し中華<>3<><>221.187.210.253<>またﾍﾞﾙﾌｪで無意味に長引かせられると面倒だ<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343388575<>7/27 20:29<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>同盟が必要になるまで軍事粘着とか？<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343388499<>7/27 20:28<>カエル<>6<>働けｱｷﾚｽ<>1.78.43.161<>【原発】総兵糧：623263/国家予算： 542554/総兵士数：295556/税率：99%/状 態：不況/国力：79306/<br>い <br>ながしき <br>が <br>ながしけれ<br> (海底都市ﾙﾙｲｴ 7/27 20:27)<>8341838b834a815b8368208dec3a8352836e838b.jpeg<>
1343387896<>7/27 20:18<>冷し中華<>3<><>221.187.210.253<>この作戦、本当に効果あるの？<br>SAN値の上がりっぷりが半端無いんだけど…<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343387536<>7/27 20:12<>袁世凱<>7<>★最終兵器<>202.253.99.157<>稼働人数少ないです<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343387513<>7/27 20:11<>poppo<>2<>★友愛<>202.229.177.14<>まーた監視だよ<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343387445<>7/27 20:10<>ガチホモ<>4<><>1.75.243.8<>監視した感じではコルホで稼働中なのは五人程度ッス<br>かなり手が足りないようでクリスピーさんが頻繁に全通してる様子<>82e282e782c882a282a9208dec3a836c8343836583428349905f.jpeg<>
1343387158<>7/27 20:05<>冷し中華<>3<><>221.187.210.253<>ぐらいさんとか普通に戦争したほうが効率いい気が<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343386864<>7/27 20:01<>poppo<>2<>★友愛<>202.229.177.15<>必死過ぎて涙が出てきた<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343386835<>7/27 20:00<>ガチホモ<>4<><>1.75.0.241<>おそらく、再同盟に人手が必要なのと戦争に勝てる人材の不足かと予想ッス<>82e282e782c882a282a9208dec3a836c8343836583428349905f.jpeg<>
1343386720<>7/27 19:58<>poppo<>2<>★友愛<>202.229.177.14<>ｼﾍﾞﾘｱが本当に封印側になった可能性が微レ存……？<br>殴り合ってNPC誘発と復興で難易度下げは分かるがわざわざﾘｳﾞｧ使うのか<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343386676<>7/27 19:57<>ガチホモ<>4<><>1.75.0.241<>コルホがﾘｳﾞｧで復興……かな？<br><br>多分その後に暗黒が一斉と予想ッス<br><>82e282e782c882a282a9208dec3a836c8343836583428349905f.jpeg<>
1343386645<>7/27 19:57<>冷し中華<>3<><>221.187.210.253<>解読班はよ<br><br>コルホーズ連邦のQQがﾘｳﾞｧｲｱｻﾝを使ったことによる罪で原発の牢獄に幽閉されました (7/27 19:56)<br>コルホーズ連邦のQQがﾘｳﾞｧｲｱｻﾝを使い原発の国力を 1000 奪いました (7/27 19:56) <>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343383622<>7/27 19:07<>市民<>2<>シ民<>222.1.71.115<>原発】総兵糧：661821/国家予算：750870/総兵士数：373719/税率：99%/状態：景気/国力：84123/<br>【朗報】ちょうちょが牢獄に連行されました<br>麦<br><>8e7396af208dec3a8356834f837d.jpeg<>
1343382645<>7/27 18:50<>冷し中華<>3<><>221.187.210.253<>店にｱﾏﾂﾐ売ってたは<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343382600<>7/27 18:50<>黒豚<>3<>ぶー<>114.69.43.55<>う゛ぁ<>82e882e582a482b382f182aa82bd8253208dec3a8d9593d8.jpeg<>
1343382586<>7/27 18:49<>七角<>2<><>219.101.5.31<>りう゛ぁー<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343382260<>7/27 18:44<>冷し中華<>3<><>221.187.210.253<>ﾘｳﾞｧ？<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343380382<>7/27 18:13<>冷し中華<>3<><>221.187.210.253<>別にセルバでﾌﾞﾚﾊとか珍しくもないし興味ない<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343380211<>7/27 18:10<>KRG<>1<><>111.86.141.139<>はたして修行のためのｾﾙﾊﾞなのか…<>4b8142528142478142208dec3a82dc82e882b382dd.jpeg<>
1343379926<>7/27 18:05<>鷹の爪<>4<><>182.249.241.74<>ペットもってるよ的な自慢か<br> <br>打ってくると思えないけど<>82e682b582be82ad82a382f1208dec3a838c839483428341835e8393.jpeg<>
1343379783<>7/27 18:03<>冷し中華<>3<><>221.187.210.253<>ﾒﾃｵ撃たれても勝率が下がるぐらいしかダメージがない気がする<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343379746<>7/27 18:02<>市民<>2<>シ民<>222.1.71.115<>停戦しときながらメテオだって？そんなことが本当にあるのか…？<>8e7396af208dec3a8356834f837d.jpeg<>
1343379613<>7/27 18:00<>鷹の爪<>4<><>182.249.241.74<>暁メテオもってる<>82e682b582be82ad82a382f1208dec3a838c839483428341835e8393.jpeg<>
1343379579<>7/27 17:59<>KRG<>1<><>111.86.141.141<>でもｼｬﾄﾞｳに負けた <br> <br> <br>くそが<>4b8142528142478142208dec3a82dc82e882b382dd.jpeg<>
1343379501<>7/27 17:58<>七角<>2<><>118.159.132.177<>修行してんじゃねーよと<>82dc82ce82bd82ab208dec3a819b4b.jpeg<>
1343379392<>7/27 17:56<>poppo<>2<>★友愛<>121.108.62.233<>【原発】総兵糧：259151/国家予算：500131/総兵士数：489675/税率：99%/状態：景気/国力：93315/<br>把握<br>ありがとう<br>KRGにｱｷﾚｽ渡した ｾﾙﾊﾞも置いた<br>５分後に五条てーせん出る<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343378860<>7/27 17:47<>市民<>2<>シ民<>222.1.71.115<>【原発の情報】<br>総兵糧：169795 <br>国家予算：368307 <br>総兵士数：399125 <br>税率：99% <br>状態：景気<>8e7396af208dec3a8356834f837d.jpeg<>
1343378121<>7/27 17:35<>poppo<>2<>★友愛<>121.108.62.233<>膠着してるし人狼か麻雀やろうぜｗｗｗｗｗ<br>操り人形でもいいぞｗｗｗｗ<>82c482a282ad82cd815b82c6208dec3a834a8343835b838b9545.jpeg<>
1343378094<>7/27 17:34<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.82<>ロプトあとに六カ国一斉だとどうなるんでしょうか？<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
