<><>
この国ではみんなで統一を目指します 　可愛い農家娘があなたの帰りを待ってるよ☆　赤シックレコードを探そう レッツ焼畑農業　このウォッカはサービスだから落ち着いて仕官して欲しい<>8d918af8208dec3a82ca82e982db.jpeg<>
のこのこの里はのどかな里だよいま　あなたの　めのまえで　そんざいかんを　はなつみんなヒィヒィ言いながら重い甲羅を背負ってこのイカれた国へさあ仕官J( 'ｰ`)し<>97ce208dec3a93fa98618ca9.jpeg<>
説明は不要でしょう、いつもの百合です。それでも説明が要るのなら勇気を出して会議室へ<>95538d8782e8208dec3a82dc82e882b382dd.jpeg<>
レバータンのお髭がチク気持ちいいー　カイゼルなんて目じゃないぜ☆　ガチホモの髭は犯罪です　流れてスローイン日本ボール、だが髭は流転する　という夢を見たのさ<>82ad82b582e182dd8250208dec3a8343834a96ba.jpeg<>
打ちならせ！変態の鐘を！！解き放て！己の全てを！！人類みな変態！！！<>95cf91d490618e6d8bb39263208dec3a82bf82e382c182bf82e3.jpeg<>
ﾙﾙｲｴ　ﾊ　ﾌﾀﾀﾋﾞ　ﾈﾑﾘ　ﾆ　ﾂｲﾀ　▼<>cbdeafb8cadeb2cadfb0816933816a208dec3a82b982c182bd82f1.jpeg<>
決起の結果、雛見沢もびっくりの避暑地になりました 薄給の代わりに穏やかな時を提供するます<>8d918af8208dec3a8d828cc5.jpeg<>
<>000.gif<>
<>91e592c38e73208dec3a81f58ddd8cdc92868fab81f5.jpeg<>
