ｱｲﾅ銀行<>ｱｲﾅ･ｻﾊﾘﾝ<>預金499<>162<>81162<><><>
ホライゾン銀行<>ホライゾン<>利率、手数料最低　自己預金100万以上<>91<>45500<><><>
黒豚銀行<>黒豚<>金欠につき金利ちょい下げ<>88<>44000<><>
<>
まりさみ銀行<>まりさみ<>おためしに立ててみました。預金額400万<>70<>35000<><><>
四条銀行<>四条<>はい<>47<>23500<><>
<>
２世銀行<>アグリ２世<>お金ないので0.5%<>45<>22500<>
逝音銀行本店<>逝音ルカ<>ご利用ありがとうございます。上限人数20名へ変更しました。<>30<>15000<><>
<>
白玉銀行<>みょん<>期間限定で金利10%<>27<>13500<>
SFFの銀行<>ARFIN<>18:35開店　利率0.5％　手数料500G 　上限4999999　安心、安全がモットーです　&quot;銀行が潰れ&quot;、預金を失った際には預金の7割を返金致します　銀行が私の生き甲斐　一回一回の利用を見る度にニヤニヤ…　預金は常にフルカンスト<>25<>12500<><><>
蛙銀行<>カエル<>手数料最低/自己預金100万<>21<>10500<><><>
ねるこ銀行<>ねるこ<>ｚｚｚ<>16<>8000<><>
<>
月曜日店<>月曜日<>手数料500G  利率0.5%  預金限度4999999G  自己預金300万以上  残り枠２名<>11<>5500<><><>
封鎖<>たいん<>してないよ<>10<>5000<>
しらたき銀行<>しらたき<>手数料500 利率0.1% 預金額4999999<>7<>3500<><><>
ベルン店<>ベルン<>日記参照。ありがとうございました！残金8万Ｇ<>6<>3000<>
おいいういい銀行<>おいいういい<>2/16 17:03営業再開　広く薄くをモットーに<>3<>1500<><><>
たそがれ銀行<>ネル<>7/1 18:13開店 しばらく貯金箱状態？<>2<>1000<><><>
台湾銀行<>心太<>きっとどんな経済不況にも耐えるはずです。たぶん　　利率0.5％　　定期的に遺産没収<>1<>500<><><>
