1343392214<>7/27 21:30<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>一斉終わったら百合以外に停戦待機一人ずつして置くか<>8347838a8369208dec3a90d48c8e.jpeg<>
1343392104<>7/27 21:28<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>今滅亡国ないしファエンリル連打でもいいんやでNPC<>8347838a8369208dec3a90d48c8e.jpeg<>
1343392008<>7/27 21:26<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>2連で飢饉とかNPCいいぞがんばれ<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343391597<>7/27 21:19<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>しないで長期連打でお願いします<br>またノアで隠れられたら困るので削っておきたい<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391558<>7/27 21:19<>とらねこ<>1<>★スネーク<>202.229.178.8<>百合は停戦しなくていいのかな？<>82cb82b182cb82b1208dec3a8d828cc5.jpeg<>
1343391503<>7/27 21:18<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>まじです・・・<br>でもすぐノアされなくてホッとした<br>今度から気をつけます・・・<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391475<>7/27 21:17<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>よし、コルホも空いたし総攻撃できる<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391469<>7/27 21:17<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>まじかよ<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343391418<>7/27 21:16<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>手紙ですればよかったと気づきましたすいません<br>ログもその部分抜かれてたみたいで・・・<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391327<>7/27 21:15<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>赤月[ｾﾌﾞﾝｽﾀｰ(笑)]	あ、そういえば９時ぴったりにイースターお願いします (原発 7/27 20:52)<br><br>言い忘れてたがこれは迂闊と言わざるを得ない<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343391242<>7/27 21:14<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>あれ、ちゃんと行揃えたのに・・・<br><br>とりあえず百合に長期連打で国力減らしてく感じで<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391200<>7/27 21:13<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>見やすくしていちおうぺたり<br>本凸<br>長期発　　　　　21時0分<br>布告・22分組発　21時23分<br>少数発　　　　　21時30分<br>布告着　　　　　21時43分<br>着弾　　　 　　 21時45分<br><br><br>追撃<br>22分組発　　　　21時48分<br>停戦発　　　　　21時50分<br>凸　　　　　　　22時10分<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391192<>7/27 21:13<>lucina<>1<>交渉人<>182.249.241.102<>同盟乙です<>_add_31333433303435333131208dec3a82dc82e882b382dd<>
1343391159<>7/27 21:12<>おじさん<>1<>TPP(笑)<>202.229.176.57<>おつん<>82a882b682b382f1208dec3a835882c882f182c682a9.jpeg<>
1343391141<>7/27 21:12<>QQ<>1<>★ああああ<>111.86.141.81<>同盟おつです<>bcdec6b0a5c5b2c228c4dabd29208dec3a834e838a83588373815b.jpeg<>
1343391117<>7/27 21:11<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>同盟乙<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343391114<>7/27 21:11<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ<>122.135.76.4<>どめつ<br>色々指示だのしてすいませんでした<>8347838a8369208dec3a90d48c8e.jpeg<>
1343391104<>7/27 21:11<>クリスピー<>1<>ニート<>210.198.80.130<>ｇｄってすまんかった　おつ<>91668ae7208dec3a82ae82e782c182bf82a5.jpeg<>
1343370651<>7/27 15:30<>とらねこ<>1<>★スネーク<>202.229.178.6<>さよならいおん<>82cb82b182cb82b1208dec3a8d828cc5.jpeg<>
1343370631<>7/27 15:30<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>もうすぐ到着<br>しばしお別れですﾉｼ<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343370411<>7/27 15:26<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>百合桜国のﾋﾟｬｱｱ!が同盟国のﾊﾟﾝﾄﾞﾗｷﾝｸﾞﾀﾞﾑに兵士を 100000 送りました (7/27 15:20)<br><br>これ支援戦争分けないでなだれ込んでるパターンじゃ・・・<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369787<>7/27 15:16<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>把握<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343369731<>7/27 15:15<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>あっおじさんが輸送してくれてるから破棄27まで待ってくだしい<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369497<>7/27 15:11<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>夕方までスーパー内政タイム<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369410<>7/27 15:10<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>同盟破棄出た<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343369325<>7/27 15:08<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>じゃあそれでいくか<br>一斉は夜やるのは変えない方針で<br>夕方に復興でよい？<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369283<>7/27 15:08<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>物資の友好上昇で100％なっちゃったね<br>同盟破棄出る？<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343369226<>7/27 15:07<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>だからノーガードで相手の復興まちをば<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343369191<>7/27 15:06<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>それとも復興して的になって封印側復興させる？<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369186<>7/27 15:06<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>俺もペットゲーには反対<br>統一が逆に遠くなる<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343369153<>7/27 15:05<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>イースター使わないと攻めれないから<br>イースターとノアは仕方ないじゃん？<>8347838a8369208dec3a90d48c8e.jpeg<>
1343369107<>7/27 15:05<>水<>8<>少数人形<>210.136.161.83<>ﾍﾟｯﾄｹﾞｰはやめた方がいいような…<>_add_31333433303433313733208dec3a82dc82e882b382dd<>
1343369080<>7/27 15:04<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>そだね<br>でもどっちがいいか悩み中<br>亀凸の方は夜の話だしコルホは俺が布告出て他の人が馬連打って感じかな<>8347838a8369208dec3a90d48c8e.jpeg<>
1343368887<>7/27 15:01<>ウガルネ<>1<><>114.175.48.249<>亀るなら今のうちに一斉表つくっといて参加あげたほうがいいと思う<>_add_31333431333334333835208dec3a82dc82e882b382dd<>
1343368723<>7/27 14:58<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>うーん凸の間にノアられる可能性考えて亀凸とかのがいいのかな？<>8347838a8369208dec3a90d48c8e.jpeg<>
1343368561<>7/27 14:56<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>奪国低くなるけどそのまま凸でいいと思う<br>前馬本凸追撃の間にノアされたら必要になるけど<>8347838a8369208dec3a90d48c8e.jpeg<>
1343368465<>7/27 14:54<>ウガルネ<>1<><>114.175.48.249<>一斉するんなら凸いれるためのｲｰｽﾀｰと着弾前のｲｱｰｽﾀｰで二つ必要じゃない？<>_add_31333431333334333835208dec3a82dc82e882b382dd<>
1343368349<>7/27 14:52<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>じゃあそれでいこう<br>でも友好してるしクリスピーの輸送は間に合うかも<br>イースターは一斉の時まではやらないつもり一斉の時には使わないと膠着状態のままだし<>8347838a8369208dec3a90d48c8e.jpeg<>
1343368323<>7/27 14:52<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>そのあとノーガード戦法で給料うまうまするかもう一度ﾉｱるかはその時の状況次第で<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343368256<>7/27 14:50<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>滅亡までさせたらまた友好に戻る<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343368252<>7/27 14:50<>水<>8<>少数人形<>210.136.161.84<>ｲｰｽﾀｰはやめた方がいいと思う<>_add_31333433303433313733208dec3a82dc82e882b382dd<>
1343368220<>7/27 14:50<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>それでもいいかも<br>どうしよう<>8347838a8369208dec3a90d48c8e.jpeg<>
1343368105<>7/27 14:48<>おいいういい<>8<>★ざわ…ざわ…<>114.134.209.123<>偽計来るに任せて決裂後シベリア凸というのは？<>836683428341815b836c208dec3a82a882a282a282a482a282a2.jpeg<>
1343368051<>7/27 14:47<>クリスピー<>1<>ニート<>210.198.80.130<>到着前に切れかねないな<br>もし切れたら捨てるね<>91668ae7208dec3a82ae82e782c182bf82a5.jpeg<>
1343367964<>7/27 14:46<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>あーやっぱ誤復興だったね<br>金そのままもらっておく<>8347838a8369208dec3a90d48c8e.jpeg<>
1343367902<>7/27 14:45<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>このタイミングで復興って誤復興かな？<br>金到着後いちおうそのまま返しておく<>8347838a8369208dec3a90d48c8e.jpeg<>
1343367844<>7/27 14:44<>水<>8<>少数人形<>210.136.161.84<>百合復興<>_add_31333433303433313733208dec3a82dc82e882b382dd<>
1343367818<>7/27 14:43<>赤月<>8<>ｾﾌﾞﾝｽﾀｰ(笑)<>122.135.76.4<>ああ、それはもちろんです<br>米金が10万超えてるから封印側のイースター来たらそっちに全輸送してまたノアりますね<>8347838a8369208dec3a90d48c8e.jpeg<>
1343367750<>7/27 14:42<>水<>8<>少数人形<>210.136.161.83<>1 引き篭る事態はないと思う わざわざﾍｯﾄﾊﾝ使ったんだし、gdgdを望む人はいないでしょう<br> <br>2 滅亡国がなだれ込んだ後 ｲｰｽﾀｰ打てばﾌｪﾝﾘﾙの効果が強くなるからいいかなという考え<>_add_31333433303433313733208dec3a82dc82e882b382dd<>
1343367721<>7/27 14:42<>クリスピー<>1<>ニート<>210.198.80.130<>復興した時少数出られるようある程度は残しておきたい<>91668ae7208dec3a82ae82e782c182bf82a5.jpeg<>
