1301045013<>3/25 18:23<>pigure<>3<>0<>180.1.46.154<>5時30分　長期内政(60分)<br>6時30分　長期凸<br>6時44分　輸送着<br>6時45分　通常凸<br>6時53分　ﾀﾞｰｸﾎｰｽ出発<br>6時58分　停戦(あずにゃんｐ)出発<br>7時00分　少数凸<br>7時15分　各自着弾<br>7時18分　停戦着<>82d282ae208dec3a706967757265.jpeg<>
1298964908<>3/1 16:35<>華<>2<>★茨の君<>61.22.250.57<>こっぽら[☆ぐぬぬ]	＜☆:ﾟ*'同性結婚'*ﾟ:☆＞イカ娘とこっぽらが結婚しました (3/1 16:11)<br><br>記念 (月華皇国ﾐﾙﾌｨｰﾕ 3/1 16:17)<br><br><br>記念と聞いてログ保存してみた<>82a982c982dd82bb82c18149208dec3a8352836e838b.jpeg<>
1298783988<>2/27 14:19<>POW<>2<><>125.204.130.251<>同盟ありがとうございます<>837983768356837d8393208dec3a504f57.jpeg<>
