1343392349<>7/27 21:32<>ミシュ<>3<><>126.10.227.166<>いいいいやっふぅうぅぅ<br>(実はじゃんけん4連敗して追い込まれてたとか言えない)<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343392306<>7/27 21:31<>袁世凱<>7<>★最終兵器<>202.253.99.170<><br>引き上げることにします 【原発の情報】 総兵糧：485789 国家予算：333404 総兵士数：165963 税率：99% 状態：飢饉 国力：69650 上記の情報をﾊﾟﾝﾄﾞﾗｷﾝｸﾞ ﾀﾞﾑの会議室に報告しま すか?<br>原発の会議室の情報をいくつか 盗み聞きできた 人は二度死ぬ【朗報】亞舞丸が 牢獄に連行されました 早く30000切らないかな イースター乙です 袁世凱の胸の内に秘めておくこ とにしました<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343392284<>7/27 21:31<>キノ<>3<>コンプガチャ(笑)<>126.29.211.5<>かっこよす<>834c836d81698a778980816a208dec3a834c836d.jpeg<>
1343392283<>7/27 21:31<>ちか<>3<><>180.50.1.7<>はらしょーっ♪<>837d838a8360838b208dec3a82dc82e882b382dd.jpeg<>
1343392262<>7/27 21:31<>冷し中華<>3<><>221.187.210.253<>ひょっとして百合の勝率100％か<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343392214<>7/27 21:30<>まりさみ<>3<><>122.26.37.53<>ひゃっはー戦争だー<>835783858341208dec3a82dc82e882b382dd.jpeg<>
1343392212<>7/27 21:30<>ミシュ<>3<><>126.10.227.166<>折り返し出ました<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343392190<>7/27 21:29<>冷し中華<>3<><>221.187.210.253<>折り返しでGo!<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343392179<>7/27 21:29<>めがねちゃん<>3<><>118.87.180.30<>折り返し<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343392163<>7/27 21:29<>まりさみ<>3<><>122.26.37.53<>着弾しますたっ<br>このまま折り返し？<>835783858341208dec3a82dc82e882b382dd.jpeg<>
1343392139<>7/27 21:28<>ミシュ<>3<><>126.10.227.166<>おうふ…着弾しました<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343392135<>7/27 21:28<>アルン<>3<>★最終兵器<>111.86.141.148<>待機してるのでどちらでも…<br>ｱﾙｶ当るかもしれないし<>967190a38d67e4bb90b282bb82cc8250208dec3a89c093de91bd.jpeg<>
1343392107<>7/27 21:28<>冷し中華<>3<><>221.187.210.253<>交戦してるはず…<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343392097<>7/27 21:28<>黒豚<>3<>ぶー<>114.69.43.55<>布告待たなくても交戦中やで！<>82d282f182ad82d482bd208dec3a8d9593d8.jpeg<>
1343392067<>7/27 21:27<>ミシュ<>3<><>126.10.227.166<>いちかく<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343392055<>7/27 21:27<>めがねちゃん<>3<><>118.87.180.30<>把握<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343392035<>7/27 21:27<>冷し中華<>3<><>221.187.210.253<>今の交戦が閉じられるまでは待機する<br>その後は変わってもらえると嬉しい、補正もあるし<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391951<>7/27 21:25<>冷し中華<>3<><>221.187.210.253<>停戦されたら先に布告しますか？＞アルンさん<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343391950<>7/27 21:25<>めがねちゃん<>3<><>118.87.180.30<>冷し中華さん戦争したいなら次から変わろうか<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343391910<>7/27 21:25<>まりさみ<>3<><>122.26.37.53<>そろそろお互い落ち着kヒヒィィィン<>835783858341208dec3a82dc82e882b382dd.jpeg<>
1343391890<>7/27 21:24<>ミシュ<>3<><>126.10.227.166<>いらんとこまでコピーしてしまった<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343391845<>7/27 21:24<>ミシュ<>3<><>126.10.227.166<>□めしうま　[投票する] 投票数：3/累計：3  投稿者：　[編集] [詳細] [AA追加]修  <br>　　　　　　　　　　　　　　　　　　　　　 　 　　　　　 r　　　　　　　ィヽ <br>　　　　　　　　　　　　　　　　　　 　　 　　　　　 　　| ヽ.　　　　 / / | <br>　　　　　　　　　　　　　　　　　　　　　　　　　　　 _ j　　vl!&#44;⌒ `'ﾉ､ノ <br>　　　　　　　　　　　　　　　　　　　　　　　　　　 ｨ!::::|ゝ'　　＼ゞ＼＼ <br>　　　　　　　　　　　　　　　　　　　　　　　　 　' /| :::|ノ　　　　iゞ､.ヾ! ヽ <br>　　　　　　　　　　　　　　　　　　 　　　　&#44;／　/　|!__|　　　　　ゞ&#44;..ﾉ`ヽ&#44;ﾘ <br>　　　　　　　　　　　　　　　　　 　　 　&#44;. '　 '　　　|!　! ／･＼　 　 　 ﾉ' <br>　　　　　　　　　　　　　　　　　　　　ｲ　　　　ﾉ' ″ ||　:::::⌒ゝ　　　&#44;　 ! <br>　　　　　　　　　　　　　　　 　　／ 　 　 　 ﾚ'/　 |r=ォ 　 　 i　 　_j._ l! <br>　　　　　　　 　 　　　 　　 　／　　/!　l!ﾚ''&quot;/　　ハメ＼　　　／&#44;. --ヽ <br>　　　　　　 　　_＿＿＿ &#44;.／　イ　/ﾉ!L&#44;ﾉ　/　　∧| ＼:::＼r/:::/ヽ. 　 !′ <br>　　　 　 &#44; 　&quot;´　　　 　 　7／ノ／ 　 　 ／　　/ 　ゞ.._ ＼::rt::/　　ヽ　ﾞ ､ <br>　　　／　　 　　 　　　/　　　　　　　 '　　　　 ' 　　　　`rーゞﾗ　rｬ　　　 i <br>　 ／　 &#44;／　　　　　　'　　　　　 ／　　　　　/　 　　　 /　　 ヽ..:.:ゞ!､&#44;.._ &#44;.:j <br>./　　ﾚ　　　　　　　'　　　　　　　　 　 　　　&#44;　　　　　/　　　 　ゝ（__人__） <br>'　　 ' 　　　　　　 i　　　　　　　　ヽ　　 　 　 　 　　 /　　　　　　`ﾄｪｪｪｲ <br>　　'　　　　　　　　　　　　　　　　　　　　　　　　　 ∧ 　　　　　　　`ー'´ <br>　 l　　　　　　　:::l　　　　　 　　 　　 　　 　　 　　イ　l <br>　 l　　　　　　　:::|　　　　 　　 　&#44;&#44; 　 　　 　　 　/　 　| <br>　 l　　　　　　　:::|　　　　/　　　　ヽ　　　　　　 ' 　 　| <br> <br><>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343391765<>7/27 21:22<>まりさみ<>3<><>122.26.37.53<>　　　　　　∧＿＿_∧ <br>（￣￣￣　　●　●　＼ <br>　￣￣）　　　　　　　　 | <br>（￣￣　　　　　　　　　 | <br>　￣￣￣￣|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　| <br>　　　　　　　|　　　　　　|　　　　　　　　　　　　　　　　　　　　　　　　　　　　　／/ <br>　　　　　　　|　　　　　　|　　　　　　　　　　　　　　　　　　　　　　　　　　　　／/ <br>　　　　　　　|　　　　　　|_＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿／　/ <br>　　　　　　　|　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　｜ <br>　　　　　　/　　　　　_＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿　　　　　　　| <br>　　　　　/　　/＼　　＼　　　　　　　　　　　　　　　　　　　　　　/　　/＼　　＼ <br>　　　　/　　/　　　＼　　＼　　　　　　　　　　　　　　　　　　　/　　/　　　＼　　＼ <br>　　　/　　/　　　　　　＼　　＼　　　　　　　　　　　　　　　　/　　/　　　　　　＼　　＼ <br>　　　＼　　＼　　　　／　　／　　　　　　　　　　　　　　　　＼　　＼　　　　／　　／ <br>　　　　　＼　　＼　　￣￣　　　　　　　　　　　　　　　　　　　　＼　　＼　　￣￣ <br>　　　　　　　＼　　＼　　　　　　　　　　　　　　　　　　　　　　　　　＼　　＼ <br>　　　　　　　／　　／　　　　　　　　　　　　　　　　　　　　　　　　　／　　／ <br>　　　　　　　￣￣　　　　　　　　　　　　　　　　　　　　　　　　　　　￣￣ <>835783858341208dec3a82dc82e882b382dd.jpeg<>
1343391682<>7/27 21:21<>ミシュ<>3<><>126.10.227.166<>　　　　　　　　　/ヾ∧<br>　　　　　　　 彡|　・　＼<br>　　　　 　 　 彡| 　丶.＿）つ<br>　　　　　　　 （ つ　　 /<br>⌒ヽ　　　　　/　　　⌒)　　　 Y⌒ヽ<br>　　人　　　 /＿＿ し　　 ノ⌒ヽ　 人　ｽﾞﾄﾞﾄﾞﾄﾞﾄﾞ…<br>Y⌒ヽ）⌒ヽ し　　　Y⌒ヽ　　　Y　　）⌒ヽ<br>￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣<>83548375838a836982cc9685208dec3a83548375838a836982cc9685.jpeg<>
1343391056<>7/27 21:10<>まりさみ<>3<><>122.26.37.53<>とりあえず馬出たけど<>835783858341208dec3a82dc82e882b382dd.jpeg<>
1343390863<>7/27 21:07<>ネイティオ神<>7<><>113.145.197.123<>輸送ができるよろこび<>836c834383658342834983548393835e208dec3a836c8343836583428349905f.jpeg<>
1343390763<>7/27 21:06<>冷し中華<>3<><>221.187.210.253<>我慢して布告でた<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390712<>7/27 21:05<>キノ<>3<>コンプガチャ(笑)<>126.29.211.5<>とりあえず馬出た<>834c836d81698a778980816a208dec3a834c836d.jpeg<>
1343390622<>7/27 21:03<>冷し中華<>3<><>221.187.210.253<>戦争出たくなってきた<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390396<>7/27 20:59<>冷し中華<>3<><>221.187.210.253<>あんまり変わらないかな<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390389<>7/27 20:59<>ホライゾン<>3<>★ﾍﾟｯﾄ牧場<>114.134.198.98<>あちらウロボかな<br>拘束明けたけどノア待機すべき？<>837d815b838183438368208dec3a837a83898343835d8393.jpeg<>
1343390267<>7/27 20:57<>袁世凱<>7<>★最終兵器<>202.253.96.149<>【原発の情報】<br>総兵糧：641152 <br>国家予算：551404 <br>総兵士数：282557 <br>税率：99% <br>状態：不況<br>国力：76859 <br>原発の会議室の情報をいくつか盗み聞きできた<br>く<br>き<br>か<br>国庫に一匹ｳﾛﾎﾞ入れときました<br>手持ちのﾏﾙｽはもうない<br>う<br>い<br><>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343390214<>7/27 20:56<>冷し中華<>3<><>221.187.210.253<>ｲｰｽﾀｰ直後にﾉｱ撃ったほうがいいのかな？<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390071<>7/27 20:54<>冷し中華<>3<><>221.187.210.253<>あぶねー捕まってた<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343390027<>7/27 20:53<>めがねちゃん<>3<><>118.87.180.30<>原発の会議室の情報をいくつか盗み聞きできた<br>い<br>あ<br>あ、そういえば９時ぴったりにイースターお願いします<br>あと兵士が足りないかもだからマルスとかないかな？<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343390027<>7/27 20:53<>さみだれ<>3<><>59.141.225.148<>私で良ければｲｰｽﾀｰやります<>b1b2d8bdcca8b0d9208dec3a82dc82e882b382dd.jpeg<>
1343389946<>7/27 20:52<>冷し中華<>3<><>221.187.210.253<>暗黒がﾉｱった場合に<br>国庫のｲｰｽﾀｰ撃てる人いますか？<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389653<>7/27 20:47<>冷し中華<>3<><>221.187.210.253<>手紙多すぎて一斉表を見失いそうになった<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389549<>7/27 20:45<>kaeru002<>7<>★画伯爵<>202.229.177.48<>期限切れで勝ちなら安心だわ<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343389454<>7/27 20:44<>冷し中華<>3<><>221.187.210.253<>弾がいないと悲しいからｳﾛﾎﾞのほうが良さそう<br>停戦が2枚いたら？気合で滑り込め！<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389314<>7/27 20:41<>めがねちゃん<>3<><>118.87.180.30<>じゃあｳﾛﾎﾞのほうがいいかな<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343389284<>7/27 20:41<>冷し中華<>3<><>221.187.210.253<>自分も布告に出る<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389268<>7/27 20:41<>冷し中華<>3<><>221.187.210.253<>「君主補正あるから自分がｳﾛﾎﾞで出たほうがいいか」<br>とか意味不明なことを考えてしまった<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389268<>7/27 20:41<>アルン<>3<>★最終兵器<>111.86.141.145<>私は布告行きます<>967190a38d67e4bb90b282bb82cc8250208dec3a89c093de91bd.jpeg<>
1343389234<>7/27 20:40<>めがねちゃん<>3<><>118.87.180.30<>あと5分しかないが布告とｳﾛﾎﾞどっち行けばいいの<>82df82aa82cb82c182b1208dec3a82df82aa82cb82bf82e182f1.jpeg<>
1343389103<>7/27 20:38<>冷し中華<>3<><>221.187.210.253<>期限切れだと封印勝利<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
1343389054<>7/27 20:37<>kaeru002<>7<>★画伯爵<>202.229.177.48<>期限切れだとどっちの勝ちなのかしら<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343388985<>7/27 20:36<>ネル<>3<>0<>123.220.252.70<>ただいまーっ!!<br>干物さん救出ありがとうございました。<>_add_31333431333334343038208dec3a82dc82e882b382dd<>
1343388866<>7/27 20:34<>袁世凱<>7<>★最終兵器<>202.253.96.153<>ウロボ一つあるで<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343388631<>7/27 20:30<>冷し中華<>3<><>221.187.210.253<>もしもﾍﾞﾙﾌｪ＆ﾉｱされた場合って<br>ﾍﾞﾙﾌｪ跨ぎしたほうがいいんだろか<>8e6e82df82dc82b582bd208dec3a82dc82e882b382dd.jpeg<>
