1333894178<>4/8 23:09<>じや<>8<><>202.229.176.167<>うちやす<>82a082a982d782a5208dec3a82da82f1977882e8.jpeg<>
1333894096<>4/8 23:08<>にゅう酸<>8<>ゴミクズ<>121.111.227.82<>すみませんが代わりに誰かお願いします…<>8eb596e98e758b4d208dec3a8d828cc5.jpeg<>
1333894067<>4/8 23:07<>本願寺光佐<>7<>★茨の君<>202.253.96.246<>うてうて<>cfbdc0b0b1bcdeb128c4dabd29208dec3a834e838a83588373815b.jpeg<>
1333894064<>4/8 23:07<>にゅう酸<>8<>ゴミクズ<>121.111.227.82<>と思ったら国庫使えなかった…<>8eb596e98e758b4d208dec3a8d828cc5.jpeg<>
1333894041<>4/8 23:07<>vavaa<>8<>★堕天使†<>111.169.11.246<>メテオ撃ってまえー<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333894009<>4/8 23:06<>vavaa<>8<>★堕天使†<>111.169.11.246<>べるへうちたい<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333893986<>4/8 23:06<>にゅう酸<>8<>ゴミクズ<>121.111.227.82<>ﾒﾃｵ打ちますか？<>8eb596e98e758b4d208dec3a8d828cc5.jpeg<>
1333893950<>4/8 23:05<>たいん<>8<>ゴミクズ<>125.207.121.19<>ひょー<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333893927<>4/8 23:05<>本願寺光佐<>7<>★茨の君<>202.253.96.244<>カレーを下回った<>cfbdc0b0b1bcdeb128c4dabd29208dec3a834e838a83588373815b.jpeg<>
1333893875<>4/8 23:04<>poppo<>7<>★ﾍﾟｯﾄ牧場<>121.108.62.233<>NPCあきらめんな<>96af8ee5937d208dec3a82bd82a982b5343182b382a2.jpeg<>
1333893850<>4/8 23:04<>ホモ<>7<>★人さらい<>182.171.190.220<>カウンターなくなったね　どうしたの<>_add_31333239363537353032208dec3a8d828cc5<>
1333893807<>4/8 23:03<>ばいかる<>7<>お腹が痛い<>202.229.177.68<>カウンターでねえ<>82a982c4815b82e882f1208dec3a82d882eb82d882eb.jpeg<>
1333893690<>4/8 23:01<>たいん<>8<>ゴミクズ<>125.207.121.19<>とりあえず把握<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333893636<>4/8 23:00<>vavaa<>8<>★堕天使†<>111.169.11.246<>まにあいそうにないでござった<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333893604<>4/8 23:00<>vavaa<>8<>★堕天使†<>111.169.11.246<>すいません　全員ここから少数連打でお願いします<br>コルホ滅亡なしで停戦も布告も枚数の差から置いときます<br>国力が低すぎて一瞬で溶けるレベルなんで安全域まで高くすることを優先します<br>お願いします<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333893574<>4/8 22:59<>Alice<>8<><>219.53.120.17<>ｱﾙｶでとびます<br>滅亡寸前ﾒﾃｵ誰かお願いします<>905e8d67208dec3a8d828cc5.jpeg<>
1333893564<>4/8 22:59<>ホモ<>7<>★人さらい<>182.171.190.220<>送られた後に偵察しちゃう　なんという・・情けない<>_add_31333239363537353032208dec3a8d828cc5<>
1333893490<>4/8 22:58<>ホモ<>7<>★人さらい<>182.171.190.220<>【変態紳士教団】総兵糧：49618/国家予算：1950/総兵士数：65558/<>_add_31333239363537353032208dec3a8d828cc5<>
1333893245<>4/8 22:54<>じや<>8<><>202.229.176.168<>ごめん五条と間違えた<>82a082a982d782a5208dec3a82da82f1977882e8.jpeg<>
1333893198<>4/8 22:53<>ぐらっちぇ<>8<>エスポワール(笑)<>111.86.147.99<>変態停戦失敗<br>五条凸出ました<>82cc82d3815b208dec3a82ae82e782b382f1.jpeg<>
1333893092<>4/8 22:51<>たいん<>8<>ゴミクズ<>125.207.121.19<>ﾌｪﾝﾘﾙ間に合えば20分後に<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333893032<>4/8 22:50<>vavaa<>8<>★堕天使†<>111.169.11.246<>ｱﾙｶとﾌｪﾝﾘﾙもいきましょうか<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892814<>4/8 22:46<>vavaa<>8<>★堕天使†<>111.169.11.246<>百合停戦行きました<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892757<>4/8 22:45<>Alice<>8<><>219.53.120.17<>ﾙｲｽﾞさんの自前ならあるとかないとか<br><br>国庫ｱﾙｶ使ってもいいでしょうか<>905e8d67208dec3a8d828cc5.jpeg<>
1333892738<>4/8 22:45<>たいん<>8<><>125.207.121.19<>了解ー<br>あとはﾌｪﾝﾘﾙくらいかなあ使えそうなのは<br>ﾒﾃｵは国庫入れとく<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333892676<>4/8 22:44<>vavaa<>8<>★堕天使†<>111.169.11.246<>イースター撃てるなら打つに越したことはないですけどありましたっけ？<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892608<>4/8 22:43<>vavaa<>8<>★堕天使†<>111.169.11.246<>多分ｶﾚｰの軍事で他も大差ない物資だと思うんで効果薄いかも<br>鬱と確実に10万切るコースにはいるから撃たないほうが無難じゃないでしょうか<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892608<>4/8 22:43<>おまめ<>7<>☆音痴<>114.17.243.8<>この局面ならｲｰｽﾀｰ撃つといいかも～<font color="#00FA9A">♪</font><>836e815b8373815b208dec3a926390ee90e5906c8fb6.jpeg<>
1333892557<>4/8 22:42<>Alice<>8<><>219.53.120.17<>滅亡寸前でﾒﾃｵ撃って嫌がらせしてしまおう（提案）<>905e8d67208dec3a8d828cc5.jpeg<>
1333892509<>4/8 22:41<>たいん<>8<><>125.207.121.19<>うちの物資がなくなったらﾛﾌﾟﾄ打ってみる？<br>凸もっと出るならの話<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333892383<>4/8 22:39<>Alice<>8<><>219.53.120.17<>国庫ゼウス使います<>905e8d67208dec3a8d828cc5.jpeg<>
1333892293<>4/8 22:38<>vavaa<>8<>★堕天使†<>111.169.11.246<>偵察乙です<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892264<>4/8 22:37<>ホモ<>7<>★人さらい<>182.171.190.220<>偵察遅れた　ごめんなさい<>_add_31333239363537353032208dec3a8d828cc5<>
1333892184<>4/8 22:36<>ホモ<>7<>★人さらい<>182.171.190.220<>【コルホーズ連邦】総兵糧：303290/国家予算：151318/総兵士数：118378/ <>_add_31333239363537353032208dec3a8d828cc5<>
1333892116<>4/8 22:35<>ぐらっちぇ<>8<>エスポワール(笑)<>111.86.147.104<>ﾜﾀｽの停戦の遅さとﾍﾟｯﾄ<br>後の気合い<br><br>てかまだ負けてないから<>82cc82d3815b208dec3a82ae82e782b382f1.jpeg<>
1333892074<>4/8 22:34<>poppo<>7<>★ﾍﾟｯﾄ牧場<>121.108.62.233<>か　そ<>96af8ee5937d208dec3a82bd82a982b5343182b382a2.jpeg<>
1333892053<>4/8 22:34<>vavaa<>8<>★堕天使†<>111.169.11.246<>夜の時間帯に耐えられるわけないよねー<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333892024<>4/8 22:33<>ばいかる<>7<>お腹が痛い<>202.229.177.69<>ズバリ敗因は<>82a982c4815b82e882f1208dec3a82d882eb82d882eb.jpeg<>
1333891680<>4/8 22:28<>ぐらっちぇ<>8<>エスポワール(笑)<>111.86.147.108<>物資10万切らない程度に悪あがきー悪あがきー<>82cc82d3815b208dec3a82ae82e782b382f1.jpeg<>
1333891667<>4/8 22:27<>Alice<>8<><>219.53.120.17<>内政明け使わせていただきます<br>手の空いてる方いるのでしたら使ってください<>905e8d67208dec3a8d828cc5.jpeg<>
1333891612<>4/8 22:26<>vavaa<>8<>★堕天使†<>111.169.11.246<>やっちゃいましょう<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333891591<>4/8 22:26<>Alice<>8<><>219.53.120.17<>悪あがきになるかもしれないけど国庫ゼウス使ってもいいでしょうか？<>905e8d67208dec3a8d828cc5.jpeg<>
1333891576<>4/8 22:26<>vavaa<>8<>★堕天使†<>111.169.11.246<>お願いします<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333891551<>4/8 22:25<>たいん<>8<><>125.207.121.19<>コルホ凸るよ<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333891543<>4/8 22:25<>vavaa<>8<>★堕天使†<>111.169.11.246<>緑行きます<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333891423<>4/8 22:23<>vavaa<>8<>★堕天使†<>111.169.11.246<>次メテオ来たらどちらにしろ全国一斉で終わりなので〆ときましょうか<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333891179<>4/8 22:19<>たいん<>8<><>125.207.121.19<>ﾒﾃｵ次第だから無駄になるかも<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
1333891154<>4/8 22:19<>ぐらっちぇ<>8<>エスポワール(笑)<>111.86.147.110<>後10分で五条に停戦つく<br>変態はその後でいく<>82cc82d3815b208dec3a82ae82e782b382f1.jpeg<>
1333891116<>4/8 22:18<>vavaa<>8<>★堕天使†<>111.169.11.246<>全国一斉とかかけらも予想してなかった<br>停戦お願いします……<>b4b1b0cfbf208dec3a7661766161.jpeg<>
1333891086<>4/8 22:18<>たいん<>8<><>125.207.121.19<>そろそろ滅亡国閉じた方がいいかと思って<br>全国一斉的に<>c3dedac3deda208dec3a82e782e782db815b82c6.jpeg<>
