1343391957<>7/27 21:25<>ぽぬ<>7<>＠2725<>111.86.141.69<>ベランダに干されてるパンツにクチバシが届くんです、多分<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343391737<>7/27 21:22<>ベルン<>7<><>111.232.195.135<>あと少し…ど、どうなるんでしょう<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343390332<>7/27 20:58<>ネイティオ神<>7<><>113.145.197.123<>あと少しで…あと少しで…<>836c834383658342834983548393835e208dec3a836c8343836583428349905f.jpeg<>
1343389891<>7/27 20:51<>ぽぬ<>7<>＠2725<>111.86.141.73<>夢に孵化値をまわしたい…<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343389686<>7/27 20:48<>シオン<>7<><>210.136.161.7<>ハテナと夢に孵化する努力持ってかれる・・・<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343389638<>7/27 20:47<>ぽぬ<>7<>＠2725<>111.86.141.74<>生きるのです<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343389592<>7/27 20:46<>ベルン<>7<><>111.232.195.135<>自分より素早さ低い山のクワガタに22万持って行かれた…<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343389584<>7/27 20:46<>kaeru002<>7<>★画伯爵<>202.229.177.48<>一回孵せばいいじゃん<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343389198<>7/27 20:39<>シオン<>7<><>210.136.161.7<>ハズレ捨てたいけどネオだと思うとなかなか<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343388910<>7/27 20:35<>袁世凱<>7<>★最終兵器<>202.253.99.151<>よくある<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343388749<>7/27 20:32<>シオン<>7<><>210.136.161.8<>ﾃﾞﾋﾞﾙｴｯｸﾞを拾いました!<br>しかし、預かり所がいっぱいなのでﾃﾞﾋﾞﾙｴｯｸﾞをあきらめました<br>討伐を続けますか?<br><br>ふぇえ・・・<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343388448<>7/27 20:27<>ベルン<>7<><>111.232.195.135<>素早さあんまり無いからソーランで切り刻んできますね<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343388243<>7/27 20:24<>シオン<>7<><>210.136.161.8<>蹴りとｿｰﾗﾝで捗る捗る<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343388171<>7/27 20:22<>袁世凱<>7<>★最終兵器<>202.253.99.158<>無技と風技オススメ<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343387802<>7/27 20:16<>ベルン<>7<><>111.232.195.135<>討伐いいですね。じゃあ久々にやろうかな<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343387478<>7/27 20:11<>袁世凱<>7<>★最終兵器<>202.253.99.153<>討伐初めてみたらどうよ<>bcdeaeb0b6b0208dec3a82cc82ce82c582a2.jpeg<>
1343387353<>7/27 20:09<>ベルン<>7<><>111.232.195.135<>ただいまです<br>やること無い…<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343385842<>7/27 19:44<>シオン<>7<><>202.229.177.44<>倉庫妊娠中や・・・<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343384774<>7/27 19:26<>ぽぬ<>7<>＠2725<>111.86.141.73<>そんなあなたにハズレをプレゼント<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343382744<>7/27 18:52<>シオン<>7<><>202.229.177.64<>シオンの流星蹴り!!<br>白黒 に 682 のﾀﾞﾒｰｼﾞをあたえた!<br>白黒を倒しました<br>6 の経験値と 736 Gを手に入れました<br>ﾊｽﾞﾚｴｯｸﾞを拾いました!<br>ﾊｽﾞﾚｴｯｸﾞを預かり所に送りました!<br>討伐を続けますか?<br><br>山でハズレなんてあんまりじゃないか・・・<>95bd8fbc96ad8e71208dec3a82dc82e882b382dd.jpeg<>
1343382434<>7/27 18:47<>亞舞丸<>7<>ペテン師<>180.32.106.94<>たしかに、気になりますね。<>_add_31333431303635373835208dec3a98b195918adb<>
1343381700<>7/27 18:35<>干物<>7<>強欲<>106.160.76.38<>脱獄のあの左・真ん中？・右って意味あるんじゃろか<>000.gif<>
1343381661<>7/27 18:34<>ぽぬ<>7<>＠2725<>111.86.141.72<>と言っても最悪な時すよ<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343380996<>7/27 18:23<>空の神兵<>7<>0<>123.108.239.243<>私の3倍・・・運がなかったですね<>_add_31333433303437333038208dec3a82dc82e882b382dd<>
1343380812<>7/27 18:20<>ぽぬ<>7<>＠2725<>111.86.141.71<>おかえんさい ２時間拘留とかまぢこわい<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343378511<>7/27 17:41<>空の神兵<>7<>0<>123.108.237.136<>帰ってこれた！<br>初牢獄だったから勝手がわからなくて焦ったよ<>_add_31333433303437333038208dec3a82dc82e882b382dd<>
1343374060<>7/27 16:27<>kaeru002<>7<>★画伯爵<>124.146.175.47<>飽きた<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343373792<>7/27 16:23<>ネイティオ神<>7<><>113.145.197.123<>のほほん<>836c834383658342834983548393835e208dec3a836c8343836583428349905f.jpeg<>
1343369732<>7/27 15:15<>kaeru002<>7<>★画伯爵<>202.229.177.33<>【コルホーズ連邦】総兵糧：395928/国家予算：672555/総兵士数：325514/税率：1%/状態：景気/国力：3204/<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343366128<>7/27 14:15<>干物<>7<>強欲<>106.160.76.38<>しゃーなし<>000.gif<>
1343364855<>7/27 13:54<>ネイティオ神<>7<><>110.163.227.66<>輸送中に捕まっちゃってごめんなさい<br>さっき封印見てたらなんだかしんどくなってきたのであんまり働かなくなるかもです<>000.gif<>
1343364429<>7/27 13:47<>kaeru002<>7<>★画伯爵<>202.229.177.33<>【コルホーズ連邦】総兵糧：953555/国家予算：999999/総兵士数：350212/税率：1%/状態：景気/国力：3045/<br>ぼくはなにをしでかすか……【朗報】おまめが牢獄に連行されました<br>【朗報】あみっけ☆が牢獄に連行されました<br><>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343361816<>7/27 13:03<>kaeru002<>7<>★画伯爵<>202.229.177.32<>【コルホーズ連邦】総兵糧：863830/国家予算：932286/総兵士数：308706/税率：50%/状態：景気/国力：2633/<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343361475<>7/27 12:57<>亞舞丸<>7<>ペテン師<>180.32.106.94<>何をすればいいのか良くわからないので<br>とりあえず内政やっときます。<>_add_31333431303635373835208dec3a98b195918adb<>
1343358652<>7/27 12:10<>kaeru002<>7<>★画伯爵<>202.229.176.47<>パチンコなんて金のムダ<br>信じるものはお馬さん<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343358568<>7/27 12:09<>ぽぬ<>7<>＠2725<>111.86.141.71<>そんなあなたに沼 もうＪＰでたけど<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343358463<>7/27 12:07<>kaeru002<>7<>★画伯爵<>202.229.177.53<>どっかのアホにベルフェ連打されてるのと同じくらい退屈なんだけど<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343358296<>7/27 12:04<>ぽぬ<>7<>＠2725<>111.86.141.71<>これは完全にノア暗黒といふ新ジャンル開拓すな 次もこの展開になりそう<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343358269<>7/27 12:04<>kaeru002<>7<>★画伯爵<>202.229.177.52<>【コルホーズ連邦】総兵糧：972873/国家予算：991199/総兵士数：343609/税率：50%/状態：飢饉/国力：998/<>c0deb2bcdeaeb0ccde28c4dabd29208dec3a6b61657275303032.jpeg<>
1343352028<>7/27 10:20<>空の神兵<>7<>0<>123.108.237.137<>【コルホーズ連邦】総兵糧：985999/国家予算：991999/総兵士数：160616/税率：50%/状態：飢饉/国力：1861/<br>了解<br>少数連打してみる<br>少数出られるなら停戦より凸出たほうがいい<br>どうせ偽計地獄ですぐ交戦だし<br><>_add_31333433303437333038208dec3a82dc82e882b382dd<>
1343347835<>7/27 09:10<>咲夜<>7<>0<>121.108.9.233<>おはようですー。<>_add_31333433303435323338208dec3a82dc82e882b382dd<>
1343347066<>7/27 08:57<>ｱｲﾔｰ<>7<>0<>219.160.172.120<>おはようございますー。<>0<>
1343345955<>7/27 08:39<>ぽぬ<>7<>＠2725<>111.86.141.78<>おっはすー<>82cd82a682c682e882db82af82e082f1208dec3a8be2.jpeg<>
1343345433<>7/27 08:30<>ネイティオ神<>7<><>113.145.197.123<>いってらっしゃいませ<>000.gif<>
1343345149<>7/27 08:25<>亞舞丸<>7<>ペテン師<>180.32.106.94<>おはようございます。<br>いってらです。<>_add_31333431303635373835208dec3a98b195918adb<>
1343344915<>7/27 08:21<>ベルン<>7<><>111.232.192.47<>おはです<br>そしていってきます<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343344577<>7/27 08:16<>姜維<>7<><>111.86.141.149<>（　＾ω＾）おは<>82e282e99576208dec3a9b4988db.jpeg<>
1343344307<>7/27 08:11<>ネイティオ神<>7<><>113.145.197.123<>おはです<>000.gif<>
1343344195<>7/27 08:09<>ベルン<>7<><>111.232.192.47<>ぽぬさんありがとうございました！<br>偵察乙です<>_add_31333433303433323038208dec3a82dc82e882b382dd<>
1343344188<>7/27 08:09<>空の神兵<>7<>0<>123.108.237.141<>おはようございます！<br>国情報見ずに二回も大規模商業しちゃったorz<>_add_31333433303437333038208dec3a82dc82e882b382dd<>
