1343392264<>7/27 21:31<>牡丹<>5<><>121.111.227.80<>戦争しに緑に行ってきます<>83728358835082bd82f1208dec3a89b2924f.jpeg<>
1343390757<>7/27 21:05<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>111.86.147.81<>ｷﾞｷﾞｷﾞ・・・<>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343389969<>7/27 20:52<>ジョニー<>5<>Ｗスネイク<>60.236.152.152<>持っていたﾄﾞﾘｰﾑｴｯｸﾞが光だしました!<br>なんと、ﾄﾞﾘｰﾑｴｯｸﾞの中から ｶﾞﾌﾞﾘｴﾙ が産まれました<br>ｶﾞﾌﾞﾘｴﾙ＜またせたなっ！<br><br>ｶﾞﾌﾞﾘｴﾙは預かり所に送られました<br><br>前後賞こっちにきたわ^^<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343387727<>7/27 20:15<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>111.86.147.80<>資金 2194 G<br>宝ｸｼﾞ【2108】<br>【第2回の当選番号】<br>武器賞【2257：ﾊﾙﾊﾞｰﾄﾞ】<br>ﾀﾏｺﾞ賞【2107：ｴﾘｰﾄｴｯｸﾞ】<br>金貨賞【2023：390000 G】<br>宝くじは１枚 1000 Gだよ<br>第3回の当選発表は 8月3日19時28分頃だよ<br>新しいのを買う場合は、今持っているくじを引き取るよ<br><br>前後賞を要求する！<>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343387162<>7/27 20:06<>おまめ<>5<>PLOK!<>114.17.243.8<>【宝くじ当選発表】<br>武器賞【2257】ﾊﾙﾊﾞｰﾄﾞ<br>ﾀﾏｺﾞ賞【2107】ｴﾘｰﾄｴｯｸﾞ<br>金貨賞【2023】390000 G<br><br>あいかわらず当たらないことに定評があるな<br>確かぼくのクジは2100だったはず<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343387136<>7/27 20:05<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>111.86.147.79<>ぱんつうp！<>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343386254<>7/27 19:50<>ジョニー<>5<>Ｗスネイク<>110.163.218.76<>青くて水玉模様と書くとパンツみたい<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343386116<>7/27 19:48<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>111.86.147.69<>ﾘｸｴｽﾄされたﾍﾟｰｼﾞは表示できません。 <br><br>もしもしェ・・・<>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343385188<>7/27 19:33<>ジョニー<>5<>Ｗスネイク<>110.163.218.76<>いいセンスだ<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343385133<>7/27 19:32<>キリト<>5<>0<>111.86.147.197<>客？<>0<>
1343384841<>7/27 19:27<>おまめ<>5<>PLOK!<>210.151.154.91<>今日は扇子を購入<br>前に使ってたのを客に貸したらパチられた<br><br><a href="link.cgi?http://buu.pandora.nu/cgi-bin/upbbs/img-box/img20120727192522.jpg" target="_blank">http://buu.pandora.nu/cgi-bin/upbbs/img-box/img20120727192522.jpg</a><>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343382726<>7/27 18:52<>おまめ<>5<>PLOK!<>210.151.154.91<>ロミオといったらマストダイだろー<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343382266<>7/27 18:44<>アスナ<>5<>閃光<>111.86.147.168<>田中といったらロミオだろー<>834183588369288367838c8358208dec3a838b83438355.jpeg<>
1343382241<>7/27 18:44<>アスナ<>5<>閃光<>111.86.147.168<>是非使ってくだしあ<>834183588369288367838c8358208dec3a838b83438355.jpeg<>
1343381781<>7/27 18:36<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>111.86.147.69<>ｱﾅｼﾞｮの名を久々に見た <>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343378986<>7/27 17:49<>ジョニー<>5<>Ｗスネイク<>60.236.152.152<>確か俺ｱﾏﾂﾐ持ってたような気がするんだが<br>使ってええのん？<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343378615<>7/27 17:43<>ジョニー<>5<>Ｗスネイク<>110.163.218.76<>俺も名前しか知らない<br>変態で挨拶してそのままよーわからんうちに消えた<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343378454<>7/27 17:40<>おまめ<>5<>PLOK!<>210.151.154.91<>3人目はアナジョの出戻り？<br>記憶にないのだ<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343378366<>7/27 17:39<>ジョニー<>5<>Ｗスネイク<>110.163.218.76<>ジョニー<br>JOHNNY <br>Johnny<br>ジョニー田中<br>の順<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343378305<>7/27 17:38<>おまめ<>5<>PLOK!<>210.151.154.91<>3人目って誰だっけ？<br><br>1人目：度し難い変態<br>2人目：超絶紳士<br>3人目：？？<br>4人目：田中<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343378172<>7/27 17:36<>ジョニー<>5<>Ｗスネイク<>110.163.218.76<>君が4人目のジョニーだ<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343377912<>7/27 17:31<>ジョニー田中<>5<>0<>125.54.67.134<>なんとなくWIKI読んでみたけど意外と複雑そうですな<>0<>
1343377292<>7/27 17:21<>おまめ<>5<>PLOK!<>210.151.154.91<>よろしゅう<br>僕も新規です<br><br>その昔、ジョニーは二人おったんやで<br>もう一人はアナザージョニー、別名：アナジョと呼ばれていた<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343374820<>7/27 16:40<>空気嫁<>5<>★魔王<>1.72.0.172<>よろしくジョニー！<br><br>あれ？ジョニーが2人、、、！？<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343374141<>7/27 16:29<>ジョニー田中<>5<>0<>111.86.147.35<>どうもよろしく<>0<>
1343364244<>7/27 13:44<>アスナ<>5<>閃光<>111.86.147.173<>アポロン連打んぎもぢいぃい<>834183588369288367838c8358208dec3a838b83438355.jpeg<>
1343361487<>7/27 12:58<>おまめ<>5<>PLOK!<>182.249.240.21<>おかえり<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343358611<>7/27 12:10<>ｸﾗﾝ･ｸﾗﾝ<>5<>★ミラクル<>220.147.4.82<>帰ってきたど～<>834e838983938145834e83898393208dec3a8149814881638142.jpeg<>
1343326726<>7/27 03:18<>キリト<>5<>0<>111.86.147.204<>亡霊は暗黒にかえれ！<>0<>
1343320392<>7/27 01:33<>空気嫁<>5<>★魔王<>1.72.0.172<>アスナ姉さんキビしぃっ！ﾃﾞﾓｿｺｶﾞｲｲｯ<br><br>ほら、レスストッパーは恥ずかしいというかなんというか<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343318790<>7/27 01:06<>アスナ<>5<>閃光<>111.86.147.171<>自分で貼るのはどうかと<>834183588369288367838c8358208dec3a838b83438355.jpeg<>
1343315615<>7/27 00:13<>空気嫁<>5<>★魔王<>211.127.91.120<>　　　　　　　　　　 /　　　　　　　/　　ヽ　　　　／￣￣￣￣￣￣￣￣￣￣￣￣￣ <br> 　　　　　　　　 ...―/　　　　　　　　　　＿）　　＜ ちんちんキッ！キッ！キッ！ <br> 　　　　　　　　ノ:::へ＿　＿＿　　　　/　　　　　 ＼＿＿＿＿＿＿＿＿＿＿＿＿＿ <br> 　　　　　　　　|/＼:::: :::: :／::: ::::　＼/_ <br> 　　　　　　　/-o-ヽ―ヽ::-o---::::（::::::::.ヽ <br> 　　　　　　｜::￣/　　/:::::￣￣:　（:::::::::::::） 　─┼─ <br> 　　　　　　｜::::/　　:::: :::::::::::::　　　　ヽ/　　 　─┼─ <br> 　　　　　　 |　　＼｀　　　　＼　　　　 /　　　　 　│ <br> 　　　　　　 ＼　 ------　　　　　　/ 　　　　　　　|　| / <br> 　　　　　　 　 ＼　　-　　　　　　 ／　　　　　　　　 　_/<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343315141<>7/27 00:05<>空気嫁<>5<>★魔王<>1.72.0.172<>キッ！キッ！のＡＡ↑<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343314920<>7/27 00:02<>おまめ<>5<>PLOK!<>114.17.243.8<>ﾁﾝ/0 手/0 大/0 大/1 ｽﾛ/1<br>最初この表示が出た時はなにかと思った<br><br>チンシュ？<>504c4f4b21208dec3a82dc82e882b382dd.jpeg<>
1343314804<>7/27 00:00<>ピカチュウ様<>5<>ホミホミ<>126.246.28.234<>いつのまにこんな機能が<br>ありがとう<>83478352836e82bf82e182f1208dec3a82a282ed82b590e882a2.jpeg<>
1343314309<>7/26 23:51<>ジョニー<>5<>Ｗスネイク<>60.236.152.9<>対人ｶｼﾞﾉなら俺の隣で寝てるよ<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343314142<>7/26 23:49<>空気嫁<>5<>★魔王<>211.127.91.120<>ﾏｲﾙｰﾑ→個人設定で表示できます<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343313612<>7/26 23:40<>ピカチュウ様<>5<>ホミホミ<>126.246.28.234<>対人カジノってどこいっちゃったの？<>83478352836e82bf82e182f1208dec3a82a282ed82b590e882a2.jpeg<>
1343310976<>7/26 22:56<>牡丹<>5<><>121.111.227.77<>よろしくです<>83728358835082bd82f1208dec3a89b2924f.jpeg<>
1343310953<>7/26 22:55<>空気嫁<>5<>★魔王<>1.72.0.172<>よろしくお願いします！<>968289a4208dec3a8bf38b4389c5.jpeg<>
1343310928<>7/26 22:55<>アスナ<>5<>閃光<>111.86.147.166<>よろー<>834183588369288367838c8358208dec3a838b83438355.jpeg<>
1343310329<>7/26 22:45<>(´ー｀)<>5<>(ﾉ-`)ﾉ～蝉<>114.154.124.35<>しばしの間よろしくお願いしますん<>82dc82bd815b82e882968285829231208dec3a835882c882f182c682a9.jpeg<>
1343306093<>7/26 21:34<>牡丹<>5<><>121.111.227.73<>全通おつです<>83728358835082bd82f1208dec3a89b2924f.jpeg<>
1343304700<>7/26 21:11<>かぐら<>5<><>223.223.28.46<>一応する予定<>97e98158208dec3a82dc82e882b382dd.jpeg<>
1343304383<>7/26 21:06<>ジョニー<>5<>Ｗスネイク<>110.163.223.123<>うちは注意事項全通してないがいいのけ？<>837683628360905f9583208dec3a82bf82e382c182bf82e3.jpeg<>
1343302586<>7/26 20:36<>葉っぱの人<>5<>0<>202.229.176.19<>よくわからないので賛成です<>_add_31333336373433333939208dec3a9190906c<>
1343301526<>7/26 20:18<>かぐら<>5<><>223.223.28.46<>移籍という手もある<br>うちは平日布告要員いないからね…<>97e98158208dec3a82dc82e882b382dd.jpeg<>
1343301463<>7/26 20:17<>アリサ<>5<><>118.159.133.9<>滅亡102くらいまでむしり取る好機だと思って来ましたけど支援国ですか残念<>636173746572208dec3a8341838a8341.jpeg<>
1343301294<>7/26 20:14<>かぐら<>5<><>223.223.28.46<>自分も布告できそうにないから支援かなと<br>輸送なら少しはできそう<>97e98158208dec3a82dc82e882b382dd.jpeg<>
1343301247<>7/26 20:14<>牡丹<>5<><>121.111.227.79<>明日はあまり動けないので支援国の方がありがたいです<>83728358835082bd82f1208dec3a89b2924f.jpeg<>
