ﾕｸﾞﾄﾞﾗﾙ暦215年【謎】：<font color="#66CC34">のこのこの亀</font><font color="#ff9d11">新生五条</font>同盟のｱｲﾅ･ｻﾊﾘﾝがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/26 17:23)</font>
ﾕｸﾞﾄﾞﾗﾙ暦214年【深淵】：<font color="#FFCCFF">百合桜国</font><font color="#FF66CC">変態紳士教団</font>同盟のめがねちゃんがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/25 11:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>のかぐらがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/22 00:49)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:48)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:47)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:47)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:47)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>のかぐらがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:45)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:44)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の村岡○由子がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>のかぐらがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>の牡丹がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:42)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>のかぐらがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:42)</font>
ﾕｸﾞﾄﾞﾗﾙ暦213年【終焉】：<font color="#FF66CC">変態紳士教団</font>のかぐらがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/21 22:42)</font>
ﾕｸﾞﾄﾞﾗﾙ暦212年【略奪】：ﾕｸﾞﾄﾞﾗﾙ大陸を統一する者は現れませんでした <font size="1">(7/19 00:15)</font>
ﾕｸﾞﾄﾞﾗﾙ暦212年【略奪】：ﾕｸﾞﾄﾞﾗﾙ大陸を統一する者は現れませんでした <font size="1">(7/19 00:15)</font>
ﾕｸﾞﾄﾞﾗﾙ暦211年【革命】：<font color="#FFCCFF">百合櫻國</font><font color="#66CC34">のこのこの里</font>同盟の冷し中華がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/10 21:32)</font>
ﾕｸﾞﾄﾞﾗﾙ暦210年【不倶戴天】：<font color="#f0c049">国民ﾉ生活ｶ第一</font>の乙がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/10 03:06)</font>
ﾕｸﾞﾄﾞﾗﾙ暦209年【混沌】：<font color="#66CC34">のこのこの里</font><font color="#ffffff">海底都市ﾙﾙｲｴ</font>同盟のあんだーばがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/7 23:10)</font>
ﾕｸﾞﾄﾞﾗﾙ暦208年【平和】：<font color="#66CC34">のこのこの里</font>新生<font color="#CCCCCC">ﾈﾊﾞｰﾗﾝﾄﾞ</font>同盟のサンタがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/4 16:03)</font>
ﾕｸﾞﾄﾞﾗﾙ暦207年【暴君】：<font color="#FF66CC">変態紳士教団</font>新生<font color="#CCCCCC">ﾈﾊﾞｰﾗﾝﾄﾞ</font>同盟のめがねちゃんがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(7/3 23:26)</font>
ﾕｸﾞﾄﾞﾗﾙ暦206年【暗黒】：<font color="#FFCCFF">百合櫻國</font>のとらねことその仲間達が魔界を再び封印し、ﾕｸﾞﾄﾞﾗﾙ大陸にひとときの安らぎがおとずれる <font size="1">(6/28 12:43)</font>
ﾕｸﾞﾄﾞﾗﾙ暦205年【結束】：<font color="#66CC34">月華皇国ﾐﾙﾌｨｰﾕ</font><font color="#6ab3fb">コルホーズ連邦</font>同盟の白でっていうがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/25 22:02)</font>
ﾕｸﾞﾄﾞﾗﾙ暦204年【大殺界】：<font color="#66CC34">月華皇国ﾐﾙﾌｨｰﾕ</font><font color="#ffffff">海底都市ﾙﾙｲｴ</font>同盟のガチホモがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/21 01:33)</font>
ﾕｸﾞﾄﾞﾗﾙ暦203年【厄年】：<font color="#6ab3fb">コルホーズ連邦</font>のnanacyがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/19 19:56)</font>
ﾕｸﾞﾄﾞﾗﾙ暦202年【深淵】：<font color="#66CC34">月華皇国ﾐﾙﾌｨｰﾕ</font><font color="#ff9d11">新生五条</font>同盟の瑠璃がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/18 19:25)</font>
ﾕｸﾞﾄﾞﾗﾙ暦201年【監禁】：<font color="#6ab3fb">コルホーズ連邦</font><font color="#FF66CC">変態紳士教団</font>同盟のたいんがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/17 07:44)</font>
ﾕｸﾞﾄﾞﾗﾙ暦200年【混乱】：<font color="#FF66CC">変態紳士教団</font><font color="#ff9d11">新生五条</font>同盟のおいいういいがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/15 05:22)</font>
ﾕｸﾞﾄﾞﾗﾙ暦200年【混乱】：<font color="#FF66CC">変態紳士教団</font><font color="#ff9d11">新生五条</font>同盟の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/15 01:05)</font>
ﾕｸﾞﾄﾞﾗﾙ暦200年【混乱】：<font color="#FF66CC">変態紳士教団</font><font color="#ff9d11">新生五条</font>同盟の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/15 01:05)</font>
ﾕｸﾞﾄﾞﾗﾙ暦200年【混乱】：<font color="#FF66CC">変態紳士教団</font><font color="#ff9d11">新生五条</font>同盟の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/15 01:05)</font>
ﾕｸﾞﾄﾞﾗﾙ暦200年【混乱】：<font color="#FF66CC">変態紳士教団</font><font color="#ff9d11">新生五条</font>同盟の真鯛がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/15 01:05)</font>
ﾕｸﾞﾄﾞﾗﾙ暦199年【殺伐】：<font color="#66CC34">月華皇国ﾐﾙﾌｨｰﾕ</font><font color="#ff9d11">新生五条</font>同盟のガチホモがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/11 19:34)</font>
ﾕｸﾞﾄﾞﾗﾙ暦198年【略奪】：<font color="#FFCCFF">百合櫻國</font>のvavaaがﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/10 13:03)</font>
ﾕｸﾞﾄﾞﾗﾙ暦197年【絶望】：<font color="#66CC34">月華皇国ﾐﾙﾌｨｰﾕ</font><font color="#FFFF68">鬼畜国ﾊﾗﾊﾟﾝﾄﾞﾗ</font>同盟の姜杵臼がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/5 10:06)</font>
ﾕｸﾞﾄﾞﾗﾙ暦196年【暗黒】：<font color="#FFCCFF">百合櫻國</font>のアリアとその仲間達が魔界を再び封印し、ﾕｸﾞﾄﾞﾗﾙ大陸にひとときの安らぎがおとずれる <font size="1">(6/4 02:21)</font>
ﾕｸﾞﾄﾞﾗﾙ暦195年【平和】：<font color="#FF66CC">変態紳士教団</font><font color="#FFCCFF">百合櫻國</font>同盟の劉備がﾕｸﾞﾄﾞﾗﾙ大陸を統一する <font size="1">(6/2 22:54)</font>
