#================================================
# ｶｼﾞﾉ一覧
#================================================
@files = (
#	['ﾀｲﾄﾙ',		'ﾗｲﾌﾞﾗﾘ',	'ﾛｸﾞﾌｧｲﾙ名(chat_casino_xxxx←の部分)'],		'オートロード'
	['ﾁﾝﾁﾛﾘﾝver.0.9',	'chinchiro',	'', 0],
	['手本引きver.0.1',	'ponbiki',	'_p', 0],
	['大貧民ver.1.2',	'daihinmin',	'_d', 0],
	['ｽﾛｯﾄ沼',	'slot',	'_s', 0],
	['人狼',	'jinro',	'_j', 0],
	['麻雀',	'mahjang',		'_m', 1],
	['ヌメロン',	'numeron',		'_n', 0],
	['テキサスホールデムポーカー',	'texas',		'_t', 0],
	['こいこい',	'koikoi',		'_k', 0],
	['迷路',	'maze',		'_mz', 0],
	['FX',	'fx',		'_f', 0],
	['ﾄﾄ',	'toto',		'_toto', 0],
	['テスト',	'nobo',		'_nobo', 1],
	['テスト2',	'cataso',		'_cataso', 0],
);

1; # 削除不可
