#================================================
# ｶｼﾞﾉ一覧
#================================================
@files = (
#	['ﾀｲﾄﾙ',		'ﾗｲﾌﾞﾗﾘ',	'ﾛｸﾞﾌｧｲﾙ名(chat_casino_xxxx←の部分)'],		'オートロード'
	['ﾁﾝﾁﾛﾘﾝver.0.9(新)',	'chinchiro',	'', 0],
	['手本引きver.0.1',	'ponbiki',	'_p', 0],
	['大貧民ver.1.2',	'daihinmin',	'_d', 0],
	['ｽﾛｯﾄ沼',	'slot',	'_s', 0],
	['人狼',	'jinro',	'_j', 0],
	['麻雀',	'mahjang',		'_m', 1],
	['ヌメロン(新)',	'numeron',		'_n', 0],
	['テキサスホールデムポーカー',	'texas',		'_t', 0],
	['こいこい',	'koikoi',		'_k', 0],
	['こいこい第二会場',	'koikoi',		'_k2', 0],
	['迷路',	'maze',		'_mz', 0],
	['FX',	'fx',		'_f', 0],
	['ﾄﾄ',	'toto',		'_toto', 0],
	['希望の船',	'espoir',		'_e', 0],
	['テスト',	'nobo',		'_nobo', 1],
	['テスト2',	'cataso',		'_cataso', 0],
	['ニムト',	'nimmt',		'_nimmt', 0],
	['ダウト(新)',	'doubt',		'_doubt', 0],
	['銀行(新)',	'bank',		'_bank', 0],
#	['ｽｺﾞﾛｸRPG',	'dicerpg',		'_drpg', 0],
#	['10秒当て',	'tenminutes',		'_tenminutes', 0],
);

1; # 削除不可
