1343391596<>7/27 21:19<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>とりあえず支援国の中では1番国力がありますし、滅亡阻止も兼ねて戦争を行いたい方はしちゃっていいかも<br>なので税率あげますね<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343389697<>7/27 20:48<>わくわくさん<>6<>★工作員<>202.229.176.37<>様子を見ても良さそうな気がするけどどうなんだろうかな<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343389685<>7/27 20:48<>オーバーラン<>6<>破壊者<>222.227.141.50<>とりあえず、拙者も出てるでござる<>838d83628365208dec3a948e97ed97ec96b2.jpeg<>
1343389518<>7/27 20:45<>耳栓<>6<><>116.0.193.125<>半分寝てた 勝てるかわかんないけどもっかい馬出た<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343388845<>7/27 20:34<>カエル<>6<>働けｱｷﾚｽ<>1.78.43.161<>ﾒﾃｵいるかしら<>8341838b834a815b8368208dec3a8352836e838b.jpeg<>
1343388441<>7/27 20:27<>カエル<>6<>働けｱｷﾚｽ<>1.78.43.161<>【原発】総兵糧：623263/国家予算：542554/総兵士数：295556/税率：99%/状態：不況/国力：79306/<br>い<br>ながしき<br>が<br>ながしけれ<br><>8341838b834a815b8368208dec3a8352836e838b.jpeg<>
1343388301<>7/27 20:25<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>はい、一斉を行うのは↓の手紙に書いてあるとおり戦争国なので<br>支援国のルルイエは4000ほどまで国力を貯めるまで戦争をしていただけると嬉しいです<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343387833<>7/27 20:17<>耳栓<>6<><>116.0.193.125<>まだ戦争出て平気な感じ？<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343387331<>7/27 20:08<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>ああっ、そういえばこれ戦争国だった！<br>大丈夫ですよ！ゆっくりで大丈夫です！<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343387159<>7/27 20:05<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>鷹の爪	21:30に凸着で全国一斉するみたいやで<br><br>復興してくれる人がウロボで出てくれるとありがたや (新生五条 7/27 20:01)<br><br>みたいですしもう良さそう<br>もう少し多めの方が良かったようですね<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343385345<>7/27 19:35<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>チキンなのでしっかりできればそれで構いませんよ<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343384781<>7/27 19:26<>耳栓<>6<><>116.0.193.125<>苦手は無理だったー…<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343383570<>7/27 19:06<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>そうみたいでした<br>手紙を送る前に関しては不問つけ忘れてた<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343383533<>7/27 19:05<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>物資がさっきまで減ってなかったから手紙を送る前ですかね？<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343382959<>7/27 18:55<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>ハグリットもハリーの顔を忘れたので手当たり次第に持ってくるとしよう<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343382898<>7/27 18:54<>わくわくさん<>6<>★工作員<>202.229.176.3<>お話の国 今日はハーメルンの笛吹<br>カウンターない間は連れ去り放題ですね<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343382666<>7/27 18:51<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>3人は怖いのでわくわくさんは原発から子供たちを連れてきてくださると嬉しいです＞＜<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343382663<>7/27 18:51<>耳栓<>6<><>116.0.193.125<>了解した<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343382601<>7/27 18:50<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>それじゃあお願いしましょうかね？<br>あ、でもオーバーランさんも出ているので3000近くになったら気をつけてもらえるとすごい安心します<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343382594<>7/27 18:49<>わくわくさん<>6<>★工作員<>202.229.176.3<>隠密で<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343382577<>7/27 18:49<>耳栓<>6<><>116.0.193.125<>んじゃ内政開けたら馬出る<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343382545<>7/27 18:49<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>今のところ1人<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343382540<>7/27 18:49<>耳栓<>6<><>116.0.193.125<>戦争出ていい？<>82e082b582ad82cd82b182ea208dec3a8d828cc5.jpeg<>
1343382177<>7/27 18:42<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>From 百合桜国 冷し中華 (7/27 18:23)<br>五条から話がいってるか分かりませんが<br>↓五条と緑の意見を聞いた上での暫定百合案、ルルの意見くだしあ<br><br>とりあえず百合以外の国に国力4000ぐらいまで溜めてもらう<br>これで暗黒の国力を4k×5で2万削って残り7万ぐらい<br><br>暗黒の国力7万からﾛﾌﾟﾄ使いまくって戦争国で一斉凸<br><br>あとは力技で殴りまくる、引きこもられたらｲｰｽﾀｰ<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343381422<>7/27 18:30<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.78<>あ、手紙きた<br>国力4000まで戦争して欲しいそうなので、戦争したい人はお手紙下さい<br>その後何名かにお願いするので、お願いされた人は戦争して下さい<br>お願いした人は戦争にでる前に出て良いか聞いて下さい<br>復興するとその人を追放しないといけないので、戦争したい人は絶対お手紙下さい<br>というより勝手に戦争したら封印に事情を話して追放します<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343379590<>7/27 17:59<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.73<>【原発】総兵糧：259151/国家予算：500131/総兵士数：476912/税率：99%/<>836e834f838a83628368208dec3a89c093de91bd.jpeg<>
1343375518<>7/27 16:51<>わくわくさん<>6<>★工作員<>182.171.12.156<>やっと輸送の出番が来た気がする<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343375014<>7/27 16:43<>シグナム<>6<>★人力ﾒﾃｵ<>202.229.178.3<>【コルホーズ連邦】総兵糧：447401/国家予算：676558/総兵士数：223708/税率：1%/状態：景気/国力：1911/<>89d897d4208dec3a82dc82e882b382dd.jpeg<>
1343372124<>7/27 15:55<>jackson<>6<>0<>124.146.175.44<>税率下げ<>8ce488d3208dec3a834e838a83588373815b.jpeg<>
1343361291<>7/27 12:54<>わくわくさん<>6<>★工作員<>182.171.12.156<>いってらっしゃい<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343360697<>7/27 12:44<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.70<>ルルイエが本気ならいくらでも出せたのに残念<>82b182cc90678af982c990ed919591a9208dec3a8352836e838b.jpeg<>
1343360256<>7/27 12:37<>すけろく<>6<>0<>202.253.99.156<>封印側のほうが廃人が多いから数はあるとは思うんですけど！<br>ただモチベが低そうだから放出する人がいるかわかんないのが怖いです！<>82d382a7815b82a682ce815b208dec3a82b782af82eb82ad.jpeg<>
1343359842<>7/27 12:30<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.68<>しちゃえば面白そうだね<br>暗黒は待機人数少ないし<>82b182cc90678af982c990ed919591a9208dec3a8352836e838b.jpeg<>
1343359628<>7/27 12:27<>すけろく<>6<>0<>219.107.54.247<>イースター合戦なら勝てそうなんですけどね！<>82d382a7815b82a682ce815b208dec3a82b782af82eb82ad.jpeg<>
1343359548<>7/27 12:25<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.78<>すごいなあ<br>イースター使えば良さそうな状況っていうのがまたすごい<>82b182cc90678af982c990ed919591a9208dec3a8352836e838b.jpeg<>
1343357877<>7/27 11:57<>すけろく<>6<>0<>202.253.99.158<>いってらっしゃい！<>82d382a7815b82a682ce815b208dec3a82b782af82eb82ad.jpeg<>
1343357456<>7/27 11:50<>黒豚<>6<>ぶー<>114.69.43.55<>ちょいと百合で戦争してくるわ<>82e882e582a482b382f182aa82bd8253208dec3a8d9593d8.jpeg<>
1343357028<>7/27 11:43<>オーバーラン<>6<>破壊者<>222.227.141.50<>物資もたまったことでござるし、税率を下げてもよろしいでござるか？<>838d83628365208dec3a948e97ed97ec96b2.jpeg<>
1343356595<>7/27 11:36<>オーバーラン<>6<>破壊者<>222.227.141.50<>【コルホーズ連邦】総兵糧：975099/国家予算：983999/総兵士数：272844/税率：50%/状態：飢饉/国力：1494/<br>フフフ、肉体なんて…【朗報】市民が牢獄に連行されました<br>とぅーとぅー【朗報】ネイティオ神が牢獄に連行されました<br>了解<br>少数連打してみる<br><>838d83628365208dec3a948e97ed97ec96b2.jpeg<>
1343354971<>7/27 11:09<>黒豚<>6<>ぶー<>114.69.43.55<>他鯖ならガチで流刑されるぞ<br>他国に文句言われたら追放もやむなしなレベル<>82e882e582a482b382f182aa82bd8253208dec3a8d9593d8.jpeg<>
1343354772<>7/27 11:06<>餡孑<>6<>0<>219.102.101.219<>売るタイミングを考えるべきでした<br>申し訳ない<>_add_31333239373134343437208dec3a83608383839383768358<>
1343354037<>7/27 10:53<>黒豚<>6<>ぶー<>114.69.43.55<>海底都市ﾙﾙｲｴの餡孑が赤月にﾉｱを送りました (7/27 10:30) <br>流石にこれはいかんだろ・・・<>82e882e582a482b382f182aa82bd8253208dec3a8d9593d8.jpeg<>
1343344331<>7/27 08:12<>トマス・モア<>6<>大津市教育委員(笑)<>111.86.147.75<>かげろうさん輝いてますよ！<>82b182cc90678af982c990ed919591a9208dec3a8352836e838b.jpeg<>
1343343744<>7/27 08:02<>Kagerou<>6<>繁栄の糧<>221.57.108.156<>【原発】総兵糧：28680/国家予算：22389/総兵士数：420859/<>0<>
1343317628<>7/27 00:47<>カエル<>6<>働けｱｷﾚｽ<>1.78.36.14<>【原発】総兵糧：1/国家予算：0/総兵士数：210826/税率：99%/状態：景気/国力：93993/<br>なんとか退却してみるわ<br>oh・・・<br>でも俺もノアあるから気にしないでだいじょぶだず<br><>8341838b834a815b8368208dec3a8352836e838b.jpeg<>
1343317532<>7/27 00:45<>Whisper<>6<>★石油王<>106.172.157.8<>海底都市ﾙﾙｲｴから 622 Gの給与があたえられました<br><br>安すぎワロタ<>_add_31333235363336373436208dec3a8d828cc5<>
1343312899<>7/26 23:28<>カエル<>6<>働けｱｷﾚｽ<>1.78.36.14<>【原発】総兵糧：798599/国家予算：387414/総兵士数：244955/税率：99%/状態：飢饉/国力：107727/<br>気のせいがあるかもしれないけど５割の発動率でもないと思う・・・まあカウンター多い方がいいんだけどね<br><br>国ぺにも確率で反撃とか面白そうとか思った<br>やっぱり5割程度だった<br>ただの気のせい？バグ？<br><>8341838b834a815b8368208dec3a8352836e838b.jpeg<>
1343311717<>7/26 23:08<>トマス・モア<>6<>大津市教育委員(笑)<>110.74.224.178<>でも人数が足りないから6カ国一斉凸もありかなって思っちゃうんですよね＾q＾<>82b182cc90678af982c990ed919591a9208dec3a8352836e838b.jpeg<>
1343311431<>7/26 23:03<>わくわくさん<>6<>★工作員<>182.171.12.156<>君主で残念がらせて気を抜かせる作戦だったか…<>82ed82ad82ed82ad82b382f1208dec3a8ea890f0.jpeg<>
1343311258<>7/26 23:00<>黒豚<>6<>ぶー<>118.14.184.30<>暁がアレなだけで<br>他は結構いい感じ<>82e882e582a482b382f182aa82bd8253208dec3a8d9593d8.jpeg<>
